MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// Register: ANCON2
#define ANCON2 ANCON2
extern volatile unsigned char           ANCON2              __at(0xE46);
#ifndef _LIB_BUILD
asm("ANCON2 equ 0E46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
        unsigned ANSEL11                :1;
        unsigned ANSEL12                :1;
        unsigned ANSEL13                :1;
        unsigned ANSEL14                :1;
        unsigned ANSEL15                :1;
    };
    struct {
        unsigned PCFG16                 :1;
        unsigned PCFG17                 :1;
        unsigned PCFG18                 :1;
        unsigned PCFG19                 :1;
        unsigned PCFG20                 :1;
        unsigned PCFG21                 :1;
        unsigned PCFG22                 :1;
        unsigned PCFG23                 :1;
    };
} ANCON2bits_t;
extern volatile ANCON2bits_t ANCON2bits __at(0xE46);
// bitfield macros
#define _ANCON2_ANSEL8_POSN                                 0x0
#define _ANCON2_ANSEL8_POSITION                             0x0
#define _ANCON2_ANSEL8_SIZE                                 0x1
#define _ANCON2_ANSEL8_LENGTH                               0x1
#define _ANCON2_ANSEL8_MASK                                 0x1
#define _ANCON2_ANSEL9_POSN                                 0x1
#define _ANCON2_ANSEL9_POSITION                             0x1
#define _ANCON2_ANSEL9_SIZE                                 0x1
#define _ANCON2_ANSEL9_LENGTH                               0x1
#define _ANCON2_ANSEL9_MASK                                 0x2
#define _ANCON2_ANSEL10_POSN                                0x2
#define _ANCON2_ANSEL10_POSITION                            0x2
#define _ANCON2_ANSEL10_SIZE                                0x1
#define _ANCON2_ANSEL10_LENGTH                              0x1
#define _ANCON2_ANSEL10_MASK                                0x4
#define _ANCON2_ANSEL11_POSN                                0x3
#define _ANCON2_ANSEL11_POSITION                            0x3
#define _ANCON2_ANSEL11_SIZE                                0x1
#define _ANCON2_ANSEL11_LENGTH                              0x1
#define _ANCON2_ANSEL11_MASK                                0x8
#define _ANCON2_ANSEL12_POSN                                0x4
#define _ANCON2_ANSEL12_POSITION                            0x4
#define _ANCON2_ANSEL12_SIZE                                0x1
#define _ANCON2_ANSEL12_LENGTH                              0x1
#define _ANCON2_ANSEL12_MASK                                0x10
#define _ANCON2_ANSEL13_POSN                                0x5
#define _ANCON2_ANSEL13_POSITION                            0x5
#define _ANCON2_ANSEL13_SIZE                                0x1
#define _ANCON2_ANSEL13_LENGTH                              0x1
#define _ANCON2_ANSEL13_MASK                                0x20
#define _ANCON2_ANSEL14_POSN                                0x6
#define _ANCON2_ANSEL14_POSITION                            0x6
#define _ANCON2_ANSEL14_SIZE                                0x1
#define _ANCON2_ANSEL14_LENGTH                              0x1
#define _ANCON2_ANSEL14_MASK                                0x40
#define _ANCON2_ANSEL15_POSN                                0x7
#define _ANCON2_ANSEL15_POSITION                            0x7
#define _ANCON2_ANSEL15_SIZE                                0x1
#define _ANCON2_ANSEL15_LENGTH                              0x1
#define _ANCON2_ANSEL15_MASK                                0x80
#define _ANCON2_PCFG16_POSN                                 0x0
#define _ANCON2_PCFG16_POSITION                             0x0
#define _ANCON2_PCFG16_SIZE                                 0x1
#define _ANCON2_PCFG16_LENGTH                               0x1
#define _ANCON2_PCFG16_MASK                                 0x1
#define _ANCON2_PCFG17_POSN                                 0x1
#define _ANCON2_PCFG17_POSITION                             0x1
#define _ANCON2_PCFG17_SIZE                                 0x1
#define _ANCON2_PCFG17_LENGTH                               0x1
#define _ANCON2_PCFG17_MASK                                 0x2
#define _ANCON2_PCFG18_POSN                                 0x2
#define _ANCON2_PCFG18_POSITION                             0x2
#define _ANCON2_PCFG18_SIZE                                 0x1
#define _ANCON2_PCFG18_LENGTH                               0x1
#define _ANCON2_PCFG18_MASK                                 0x4
#define _ANCON2_PCFG19_POSN                                 0x3
#define _ANCON2_PCFG19_POSITION                             0x3
#define _ANCON2_PCFG19_SIZE                                 0x1
#define _ANCON2_PCFG19_LENGTH                               0x1
#define _ANCON2_PCFG19_MASK                                 0x8
#define _ANCON2_PCFG20_POSN                                 0x4
#define _ANCON2_PCFG20_POSITION                             0x4
#define _ANCON2_PCFG20_SIZE                                 0x1
#define _ANCON2_PCFG20_LENGTH                               0x1
#define _ANCON2_PCFG20_MASK                                 0x10
#define _ANCON2_PCFG21_POSN                                 0x5
#define _ANCON2_PCFG21_POSITION                             0x5
#define _ANCON2_PCFG21_SIZE                                 0x1
#define _ANCON2_PCFG21_LENGTH                               0x1
#define _ANCON2_PCFG21_MASK                                 0x20
#define _ANCON2_PCFG22_POSN                                 0x6
#define _ANCON2_PCFG22_POSITION                             0x6
#define _ANCON2_PCFG22_SIZE                                 0x1
#define _ANCON2_PCFG22_LENGTH                               0x1
#define _ANCON2_PCFG22_MASK                                 0x40
#define _ANCON2_PCFG23_POSN                                 0x7
#define _ANCON2_PCFG23_POSITION                             0x7
#define _ANCON2_PCFG23_SIZE                                 0x1
#define _ANCON2_PCFG23_LENGTH                               0x1
#define _ANCON2_PCFG23_MASK                                 0x80

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xE47);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL0                 :1;
        unsigned ANSEL1                 :1;
        unsigned ANSEL2                 :1;
        unsigned ANSEL3                 :1;
        unsigned ANSEL4                 :1;
        unsigned ANSEL5                 :1;
        unsigned ANSEL6                 :1;
        unsigned ANSEL7                 :1;
    };
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
        unsigned PCFG11                 :1;
        unsigned PCFG12                 :1;
        unsigned PCFG13                 :1;
        unsigned PCFG14                 :1;
        unsigned PCFG15                 :1;
    };
} ANCON1bits_t;
extern volatile ANCON1bits_t ANCON1bits __at(0xE47);
// bitfield macros
#define _ANCON1_ANSEL0_POSN                                 0x0
#define _ANCON1_ANSEL0_POSITION                             0x0
#define _ANCON1_ANSEL0_SIZE                                 0x1
#define _ANCON1_ANSEL0_LENGTH                               0x1
#define _ANCON1_ANSEL0_MASK                                 0x1
#define _ANCON1_ANSEL1_POSN                                 0x1
#define _ANCON1_ANSEL1_POSITION                             0x1
#define _ANCON1_ANSEL1_SIZE                                 0x1
#define _ANCON1_ANSEL1_LENGTH                               0x1
#define _ANCON1_ANSEL1_MASK                                 0x2
#define _ANCON1_ANSEL2_POSN                                 0x2
#define _ANCON1_ANSEL2_POSITION                             0x2
#define _ANCON1_ANSEL2_SIZE                                 0x1
#define _ANCON1_ANSEL2_LENGTH                               0x1
#define _ANCON1_ANSEL2_MASK                                 0x4
#define _ANCON1_ANSEL3_POSN                                 0x3
#define _ANCON1_ANSEL3_POSITION                             0x3
#define _ANCON1_ANSEL3_SIZE                                 0x1
#define _ANCON1_ANSEL3_LENGTH                               0x1
#define _ANCON1_ANSEL3_MASK                                 0x8
#define _ANCON1_ANSEL4_POSN                                 0x4
#define _ANCON1_ANSEL4_POSITION                             0x4
#define _ANCON1_ANSEL4_SIZE                                 0x1
#define _ANCON1_ANSEL4_LENGTH                               0x1
#define _ANCON1_ANSEL4_MASK                                 0x10
#define _ANCON1_ANSEL5_POSN                                 0x5
#define _ANCON1_ANSEL5_POSITION                             0x5
#define _ANCON1_ANSEL5_SIZE                                 0x1
#define _ANCON1_ANSEL5_LENGTH                               0x1
#define _ANCON1_ANSEL5_MASK                                 0x20
#define _ANCON1_ANSEL6_POSN                                 0x6
#define _ANCON1_ANSEL6_POSITION                             0x6
#define _ANCON1_ANSEL6_SIZE                                 0x1
#define _ANCON1_ANSEL6_LENGTH                               0x1
#define _ANCON1_ANSEL6_MASK                                 0x40
#define _ANCON1_ANSEL7_POSN                                 0x7
#define _ANCON1_ANSEL7_POSITION                             0x7
#define _ANCON1_ANSEL7_SIZE                                 0x1
#define _ANCON1_ANSEL7_LENGTH                               0x1
#define _ANCON1_ANSEL7_MASK                                 0x80
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4
#define _ANCON1_PCFG11_POSN                                 0x3
#define _ANCON1_PCFG11_POSITION                             0x3
#define _ANCON1_PCFG11_SIZE                                 0x1
#define _ANCON1_PCFG11_LENGTH                               0x1
#define _ANCON1_PCFG11_MASK                                 0x8
#define _ANCON1_PCFG12_POSN                                 0x4
#define _ANCON1_PCFG12_POSITION                             0x4
#define _ANCON1_PCFG12_SIZE                                 0x1
#define _ANCON1_PCFG12_LENGTH                               0x1
#define _ANCON1_PCFG12_MASK                                 0x10
#define _ANCON1_PCFG13_POSN                                 0x5
#define _ANCON1_PCFG13_POSITION                             0x5
#define _ANCON1_PCFG13_SIZE                                 0x1
#define _ANCON1_PCFG13_LENGTH                               0x1
#define _ANCON1_PCFG13_MASK                                 0x20
#define _ANCON1_PCFG14_POSN                                 0x6
#define _ANCON1_PCFG14_POSITION                             0x6
#define _ANCON1_PCFG14_SIZE                                 0x1
#define _ANCON1_PCFG14_LENGTH                               0x1
#define _ANCON1_PCFG14_MASK                                 0x40
#define _ANCON1_PCFG15_POSN                                 0x7
#define _ANCON1_PCFG15_POSITION                             0x7
#define _ANCON1_PCFG15_SIZE                                 0x1
#define _ANCON1_PCFG15_LENGTH                               0x1
#define _ANCON1_PCFG15_MASK                                 0x80

