MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// Register: ADCBUF17H
#define ADCBUF17H ADCBUF17H
extern volatile unsigned char           ADCBUF17H           __at(0xE69);
#ifndef _LIB_BUILD
asm("ADCBUF17H equ 0E69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF17H              :8;
    };
} ADCBUF17Hbits_t;
extern volatile ADCBUF17Hbits_t ADCBUF17Hbits __at(0xE69);
// bitfield macros
#define _ADCBUF17H_ADCBUF17H_POSN                           0x0
#define _ADCBUF17H_ADCBUF17H_POSITION                       0x0
#define _ADCBUF17H_ADCBUF17H_SIZE                           0x8
#define _ADCBUF17H_ADCBUF17H_LENGTH                         0x8
#define _ADCBUF17H_ADCBUF17H_MASK                           0xFF

// Register: ADCBUF18
#define ADCBUF18 ADCBUF18
extern volatile unsigned short          ADCBUF18            __at(0xE6A);
#ifndef _LIB_BUILD
asm("ADCBUF18 equ 0E6Ah");
#endif

// Register: ADCBUF18L
#define ADCBUF18L ADCBUF18L
extern volatile unsigned char           ADCBUF18L           __at(0xE6A);
#ifndef _LIB_BUILD
asm("ADCBUF18L equ 0E6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF18L              :8;
    };
} ADCBUF18Lbits_t;
extern volatile ADCBUF18Lbits_t ADCBUF18Lbits __at(0xE6A);
// bitfield macros
#define _ADCBUF18L_ADCBUF18L_POSN                           0x0
#define _ADCBUF18L_ADCBUF18L_POSITION                       0x0
#define _ADCBUF18L_ADCBUF18L_SIZE                           0x8
#define _ADCBUF18L_ADCBUF18L_LENGTH                         0x8
#define _ADCBUF18L_ADCBUF18L_MASK                           0xFF

// Register: ADCBUF18H
#define ADCBUF18H ADCBUF18H
extern volatile unsigned char           ADCBUF18H           __at(0xE6B);
#ifndef _LIB_BUILD
asm("ADCBUF18H equ 0E6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF18H              :8;
    };
} ADCBUF18Hbits_t;
extern volatile ADCBUF18Hbits_t ADCBUF18Hbits __at(0xE6B);
// bitfield macros
#define _ADCBUF18H_ADCBUF18H_POSN                           0x0
#define _ADCBUF18H_ADCBUF18H_POSITION                       0x0
#define _ADCBUF18H_ADCBUF18H_SIZE                           0x8
#define _ADCBUF18H_ADCBUF18H_LENGTH                         0x8
#define _ADCBUF18H_ADCBUF18H_MASK                           0xFF

// Register: ADCBUF19
#define ADCBUF19 ADCBUF19
extern volatile unsigned short          ADCBUF19            __at(0xE6C);
#ifndef _LIB_BUILD
asm("ADCBUF19 equ 0E6Ch");
#endif

// Register: ADCBUF19L
#define ADCBUF19L ADCBUF19L
extern volatile unsigned char           ADCBUF19L           __at(0xE6C);
#ifndef _LIB_BUILD
asm("ADCBUF19L equ 0E6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF19L              :8;
    };
} ADCBUF19Lbits_t;
extern volatile ADCBUF19Lbits_t ADCBUF19Lbits __at(0xE6C);
// bitfield macros
#define _ADCBUF19L_ADCBUF19L_POSN                           0x0
#define _ADCBUF19L_ADCBUF19L_POSITION                       0x0
#define _ADCBUF19L_ADCBUF19L_SIZE                           0x8
#define _ADCBUF19L_ADCBUF19L_LENGTH                         0x8
#define _ADCBUF19L_ADCBUF19L_MASK                           0xFF

// Register: ADCBUF19H
#define ADCBUF19H ADCBUF19H
extern volatile unsigned char           ADCBUF19H           __at(0xE6D);
#ifndef _LIB_BUILD
asm("ADCBUF19H equ 0E6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF19H              :8;
    };
} ADCBUF19Hbits_t;
extern volatile ADCBUF19Hbits_t ADCBUF19Hbits __at(0xE6D);
// bitfield macros
#define _ADCBUF19H_ADCBUF19H_POSN                           0x0
#define _ADCBUF19H_ADCBUF19H_POSITION                       0x0
#define _ADCBUF19H_ADCBUF19H_SIZE                           0x8
#define _ADCBUF19H_ADCBUF19H_LENGTH                         0x8
#define _ADCBUF19H_ADCBUF19H_MASK                           0xFF

// Register: ADCBUF20
#define ADCBUF20 ADCBUF20
extern volatile unsigned short          ADCBUF20            __at(0xE6E);
#ifndef _LIB_BUILD
asm("ADCBUF20 equ 0E6Eh");
#endif

// Register: ADCBUF20L
#define ADCBUF20L ADCBUF20L
extern volatile unsigned char           ADCBUF20L           __at(0xE6E);
#ifndef _LIB_BUILD
asm("ADCBUF20L equ 0E6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF20L              :8;
    };
} ADCBUF20Lbits_t;
extern volatile ADCBUF20Lbits_t ADCBUF20Lbits __at(0xE6E);
// bitfield macros
#define _ADCBUF20L_ADCBUF20L_POSN                           0x0
#define _ADCBUF20L_ADCBUF20L_POSITION                       0x0
#define _ADCBUF20L_ADCBUF20L_SIZE                           0x8
#define _ADCBUF20L_ADCBUF20L_LENGTH                         0x8
#define _ADCBUF20L_ADCBUF20L_MASK                           0xFF

// Register: ADCBUF20H
#define ADCBUF20H ADCBUF20H
extern volatile unsigned char           ADCBUF20H           __at(0xE6F);
#ifndef _LIB_BUILD
asm("ADCBUF20H equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF20H              :8;
    };
} ADCBUF20Hbits_t;
extern volatile ADCBUF20Hbits_t ADCBUF20Hbits __at(0xE6F);
// bitfield macros
#define _ADCBUF20H_ADCBUF20H_POSN                           0x0
#define _ADCBUF20H_ADCBUF20H_POSITION                       0x0
#define _ADCBUF20H_ADCBUF20H_SIZE                           0x8
#define _ADCBUF20H_ADCBUF20H_LENGTH                         0x8
#define _ADCBUF20H_ADCBUF20H_MASK                           0xFF

// Register: ADCBUF21
#define ADCBUF21 ADCBUF21
extern volatile unsigned short          ADCBUF21            __at(0xE70);
#ifndef _LIB_BUILD
asm("ADCBUF21 equ 0E70h");
#endif

// Register: ADCBUF21L
#define ADCBUF21L ADCBUF21L
extern volatile unsigned char           ADCBUF21L           __at(0xE70);
#ifndef _LIB_BUILD
asm("ADCBUF21L equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF21L              :8;
    };
} ADCBUF21Lbits_t;
extern volatile ADCBUF21Lbits_t ADCBUF21Lbits __at(0xE70);
// bitfield macros
#define _ADCBUF21L_ADCBUF21L_POSN                           0x0
#define _ADCBUF21L_ADCBUF21L_POSITION                       0x0
#define _ADCBUF21L_ADCBUF21L_SIZE                           0x8
#define _ADCBUF21L_ADCBUF21L_LENGTH                         0x8
#define _ADCBUF21L_ADCBUF21L_MASK                           0xFF

// Register: ADCBUF21H
#define ADCBUF21H ADCBUF21H
extern volatile unsigned char           ADCBUF21H           __at(0xE71);
#ifndef _LIB_BUILD
asm("ADCBUF21H equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF21H              :8;
    };
} ADCBUF21Hbits_t;
extern volatile ADCBUF21Hbits_t ADCBUF21Hbits __at(0xE71);
// bitfield macros
#define _ADCBUF21H_ADCBUF21H_POSN                           0x0
#define _ADCBUF21H_ADCBUF21H_POSITION                       0x0
#define _ADCBUF21H_ADCBUF21H_SIZE                           0x8
#define _ADCBUF21H_ADCBUF21H_LENGTH                         0x8
#define _ADCBUF21H_ADCBUF21H_MASK                           0xFF

// Register: ADCBUF22
#define ADCBUF22 ADCBUF22
extern volatile unsigned short          ADCBUF22            __at(0xE72);
#ifndef _LIB_BUILD
asm("ADCBUF22 equ 0E72h");
#endif

// Register: ADCBUF22L
#define ADCBUF22L ADCBUF22L
extern volatile unsigned char           ADCBUF22L           __at(0xE72);
#ifndef _LIB_BUILD
asm("ADCBUF22L equ 0E72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF22L              :8;
    };
} ADCBUF22Lbits_t;
extern volatile ADCBUF22Lbits_t ADCBUF22Lbits __at(0xE72);
// bitfield macros
#define _ADCBUF22L_ADCBUF22L_POSN                           0x0
#define _ADCBUF22L_ADCBUF22L_POSITION                       0x0
#define _ADCBUF22L_ADCBUF22L_SIZE                           0x8
#define _ADCBUF22L_ADCBUF22L_LENGTH                         0x8
#define _ADCBUF22L_ADCBUF22L_MASK                           0xFF

