MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
extern volatile unsigned char           LCDDATA6            __at(0xE94);
#ifndef _LIB_BUILD
asm("LCDDATA6 equ 0E94h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C0                  :1;
        unsigned S49C0                  :1;
        unsigned S50C0                  :1;
        unsigned S51C0                  :1;
        unsigned S52C0                  :1;
        unsigned S53C0                  :1;
        unsigned S54C0                  :1;
        unsigned S55C0                  :1;
    };
} LCDDATA6bits_t;
extern volatile LCDDATA6bits_t LCDDATA6bits __at(0xE94);
// bitfield macros
#define _LCDDATA6_S48C0_POSN                                0x0
#define _LCDDATA6_S48C0_POSITION                            0x0
#define _LCDDATA6_S48C0_SIZE                                0x1
#define _LCDDATA6_S48C0_LENGTH                              0x1
#define _LCDDATA6_S48C0_MASK                                0x1
#define _LCDDATA6_S49C0_POSN                                0x1
#define _LCDDATA6_S49C0_POSITION                            0x1
#define _LCDDATA6_S49C0_SIZE                                0x1
#define _LCDDATA6_S49C0_LENGTH                              0x1
#define _LCDDATA6_S49C0_MASK                                0x2
#define _LCDDATA6_S50C0_POSN                                0x2
#define _LCDDATA6_S50C0_POSITION                            0x2
#define _LCDDATA6_S50C0_SIZE                                0x1
#define _LCDDATA6_S50C0_LENGTH                              0x1
#define _LCDDATA6_S50C0_MASK                                0x4
#define _LCDDATA6_S51C0_POSN                                0x3
#define _LCDDATA6_S51C0_POSITION                            0x3
#define _LCDDATA6_S51C0_SIZE                                0x1
#define _LCDDATA6_S51C0_LENGTH                              0x1
#define _LCDDATA6_S51C0_MASK                                0x8
#define _LCDDATA6_S52C0_POSN                                0x4
#define _LCDDATA6_S52C0_POSITION                            0x4
#define _LCDDATA6_S52C0_SIZE                                0x1
#define _LCDDATA6_S52C0_LENGTH                              0x1
#define _LCDDATA6_S52C0_MASK                                0x10
#define _LCDDATA6_S53C0_POSN                                0x5
#define _LCDDATA6_S53C0_POSITION                            0x5
#define _LCDDATA6_S53C0_SIZE                                0x1
#define _LCDDATA6_S53C0_LENGTH                              0x1
#define _LCDDATA6_S53C0_MASK                                0x20
#define _LCDDATA6_S54C0_POSN                                0x6
#define _LCDDATA6_S54C0_POSITION                            0x6
#define _LCDDATA6_S54C0_SIZE                                0x1
#define _LCDDATA6_S54C0_LENGTH                              0x1
#define _LCDDATA6_S54C0_MASK                                0x40
#define _LCDDATA6_S55C0_POSN                                0x7
#define _LCDDATA6_S55C0_POSITION                            0x7
#define _LCDDATA6_S55C0_SIZE                                0x1
#define _LCDDATA6_S55C0_LENGTH                              0x1
#define _LCDDATA6_S55C0_MASK                                0x80

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
extern volatile unsigned char           LCDDATA7            __at(0xE95);
#ifndef _LIB_BUILD
asm("LCDDATA7 equ 0E95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C0                  :1;
        unsigned S57C0                  :1;
        unsigned S58C0                  :1;
        unsigned S59C0                  :1;
        unsigned S60C0                  :1;
        unsigned S61C0                  :1;
        unsigned S62C0                  :1;
        unsigned S63C0                  :1;
    };
} LCDDATA7bits_t;
extern volatile LCDDATA7bits_t LCDDATA7bits __at(0xE95);
// bitfield macros
#define _LCDDATA7_S56C0_POSN                                0x0
#define _LCDDATA7_S56C0_POSITION                            0x0
#define _LCDDATA7_S56C0_SIZE                                0x1
#define _LCDDATA7_S56C0_LENGTH                              0x1
#define _LCDDATA7_S56C0_MASK                                0x1
#define _LCDDATA7_S57C0_POSN                                0x1
#define _LCDDATA7_S57C0_POSITION                            0x1
#define _LCDDATA7_S57C0_SIZE                                0x1
#define _LCDDATA7_S57C0_LENGTH                              0x1
#define _LCDDATA7_S57C0_MASK                                0x2
#define _LCDDATA7_S58C0_POSN                                0x2
#define _LCDDATA7_S58C0_POSITION                            0x2
#define _LCDDATA7_S58C0_SIZE                                0x1
#define _LCDDATA7_S58C0_LENGTH                              0x1
#define _LCDDATA7_S58C0_MASK                                0x4
#define _LCDDATA7_S59C0_POSN                                0x3
#define _LCDDATA7_S59C0_POSITION                            0x3
#define _LCDDATA7_S59C0_SIZE                                0x1
#define _LCDDATA7_S59C0_LENGTH                              0x1
#define _LCDDATA7_S59C0_MASK                                0x8
#define _LCDDATA7_S60C0_POSN                                0x4
#define _LCDDATA7_S60C0_POSITION                            0x4
#define _LCDDATA7_S60C0_SIZE                                0x1
#define _LCDDATA7_S60C0_LENGTH                              0x1
#define _LCDDATA7_S60C0_MASK                                0x10
#define _LCDDATA7_S61C0_POSN                                0x5
#define _LCDDATA7_S61C0_POSITION                            0x5
#define _LCDDATA7_S61C0_SIZE                                0x1
#define _LCDDATA7_S61C0_LENGTH                              0x1
#define _LCDDATA7_S61C0_MASK                                0x20
#define _LCDDATA7_S62C0_POSN                                0x6
#define _LCDDATA7_S62C0_POSITION                            0x6
#define _LCDDATA7_S62C0_SIZE                                0x1
#define _LCDDATA7_S62C0_LENGTH                              0x1
#define _LCDDATA7_S62C0_MASK                                0x40
#define _LCDDATA7_S63C0_POSN                                0x7
#define _LCDDATA7_S63C0_POSITION                            0x7
#define _LCDDATA7_S63C0_SIZE                                0x1
#define _LCDDATA7_S63C0_LENGTH                              0x1
#define _LCDDATA7_S63C0_MASK                                0x80

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
extern volatile unsigned char           LCDDATA8            __at(0xE96);
#ifndef _LIB_BUILD
asm("LCDDATA8 equ 0E96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C1                  :1;
        unsigned S01C1                  :1;
        unsigned S02C1                  :1;
        unsigned S03C1                  :1;
        unsigned S04C1                  :1;
        unsigned S05C1                  :1;
        unsigned S06C1                  :1;
        unsigned S07C1                  :1;
    };
} LCDDATA8bits_t;
