MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
extern volatile unsigned char           LCDDATA17           __at(0xE9F);
#ifndef _LIB_BUILD
asm("LCDDATA17 equ 0E9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C2                  :1;
        unsigned S09C2                  :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned S12C2                  :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
} LCDDATA17bits_t;
extern volatile LCDDATA17bits_t LCDDATA17bits __at(0xE9F);
// bitfield macros
#define _LCDDATA17_S08C2_POSN                               0x0
#define _LCDDATA17_S08C2_POSITION                           0x0
#define _LCDDATA17_S08C2_SIZE                               0x1
#define _LCDDATA17_S08C2_LENGTH                             0x1
#define _LCDDATA17_S08C2_MASK                               0x1
#define _LCDDATA17_S09C2_POSN                               0x1
#define _LCDDATA17_S09C2_POSITION                           0x1
#define _LCDDATA17_S09C2_SIZE                               0x1
#define _LCDDATA17_S09C2_LENGTH                             0x1
#define _LCDDATA17_S09C2_MASK                               0x2
#define _LCDDATA17_S10C2_POSN                               0x2
#define _LCDDATA17_S10C2_POSITION                           0x2
#define _LCDDATA17_S10C2_SIZE                               0x1
#define _LCDDATA17_S10C2_LENGTH                             0x1
#define _LCDDATA17_S10C2_MASK                               0x4
#define _LCDDATA17_S11C2_POSN                               0x3
#define _LCDDATA17_S11C2_POSITION                           0x3
#define _LCDDATA17_S11C2_SIZE                               0x1
#define _LCDDATA17_S11C2_LENGTH                             0x1
#define _LCDDATA17_S11C2_MASK                               0x8
#define _LCDDATA17_S12C2_POSN                               0x4
#define _LCDDATA17_S12C2_POSITION                           0x4
#define _LCDDATA17_S12C2_SIZE                               0x1
#define _LCDDATA17_S12C2_LENGTH                             0x1
#define _LCDDATA17_S12C2_MASK                               0x10
#define _LCDDATA17_S13C2_POSN                               0x5
#define _LCDDATA17_S13C2_POSITION                           0x5
#define _LCDDATA17_S13C2_SIZE                               0x1
#define _LCDDATA17_S13C2_LENGTH                             0x1
#define _LCDDATA17_S13C2_MASK                               0x20
#define _LCDDATA17_S14C2_POSN                               0x6
#define _LCDDATA17_S14C2_POSITION                           0x6
#define _LCDDATA17_S14C2_SIZE                               0x1
#define _LCDDATA17_S14C2_LENGTH                             0x1
#define _LCDDATA17_S14C2_MASK                               0x40
#define _LCDDATA17_S15C2_POSN                               0x7
#define _LCDDATA17_S15C2_POSITION                           0x7
#define _LCDDATA17_S15C2_SIZE                               0x1
#define _LCDDATA17_S15C2_LENGTH                             0x1
#define _LCDDATA17_S15C2_MASK                               0x80

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0xEA0);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 0EA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C2                  :1;
        unsigned S17C2                  :1;
        unsigned S18C2                  :1;
        unsigned S19C2                  :1;
        unsigned S20C2                  :1;
        unsigned S21C2                  :1;
        unsigned S22C2                  :1;
        unsigned S23C2                  :1;
    };
} LCDDATA18bits_t;
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0xEA0);
// bitfield macros
#define _LCDDATA18_S16C2_POSN                               0x0
#define _LCDDATA18_S16C2_POSITION                           0x0
#define _LCDDATA18_S16C2_SIZE                               0x1
#define _LCDDATA18_S16C2_LENGTH                             0x1
#define _LCDDATA18_S16C2_MASK                               0x1
#define _LCDDATA18_S17C2_POSN                               0x1
#define _LCDDATA18_S17C2_POSITION                           0x1
#define _LCDDATA18_S17C2_SIZE                               0x1
#define _LCDDATA18_S17C2_LENGTH                             0x1
#define _LCDDATA18_S17C2_MASK                               0x2
#define _LCDDATA18_S18C2_POSN                               0x2
#define _LCDDATA18_S18C2_POSITION                           0x2
#define _LCDDATA18_S18C2_SIZE                               0x1
#define _LCDDATA18_S18C2_LENGTH                             0x1
#define _LCDDATA18_S18C2_MASK                               0x4
#define _LCDDATA18_S19C2_POSN                               0x3
#define _LCDDATA18_S19C2_POSITION                           0x3
#define _LCDDATA18_S19C2_SIZE                               0x1
#define _LCDDATA18_S19C2_LENGTH                             0x1
#define _LCDDATA18_S19C2_MASK                               0x8
#define _LCDDATA18_S20C2_POSN                               0x4
#define _LCDDATA18_S20C2_POSITION                           0x4
#define _LCDDATA18_S20C2_SIZE                               0x1
#define _LCDDATA18_S20C2_LENGTH                             0x1
#define _LCDDATA18_S20C2_MASK                               0x10
#define _LCDDATA18_S21C2_POSN                               0x5
#define _LCDDATA18_S21C2_POSITION                           0x5
#define _LCDDATA18_S21C2_SIZE                               0x1
#define _LCDDATA18_S21C2_LENGTH                             0x1
#define _LCDDATA18_S21C2_MASK                               0x20
#define _LCDDATA18_S22C2_POSN                               0x6
#define _LCDDATA18_S22C2_POSITION                           0x6
#define _LCDDATA18_S22C2_SIZE                               0x1
#define _LCDDATA18_S22C2_LENGTH                             0x1
#define _LCDDATA18_S22C2_MASK                               0x40
#define _LCDDATA18_S23C2_POSN                               0x7
#define _LCDDATA18_S23C2_POSITION                           0x7
#define _LCDDATA18_S23C2_SIZE                               0x1
#define _LCDDATA18_S23C2_LENGTH                             0x1
#define _LCDDATA18_S23C2_MASK                               0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0xEA1);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 0EA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C2                  :1;
        unsigned S25C2                  :1;
        unsigned S26C2                  :1;
        unsigned S27C2                  :1;
        unsigned S28C2                  :1;
        unsigned S29C2                  :1;
        unsigned S30C2                  :1;
        unsigned S31C2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned T3CKPS019              :1;
        unsigned T3CKPS119              :1;
        unsigned TMR3CS019              :1;
        unsigned TMR3CS119              :1;
    };
} LCDDATA19bits_t;
extern volatile LCDDATA19bits_t LCDDATA19bits __at(0xEA1);
// bitfield macros
#define _LCDDATA19_S24C2_POSN                               0x0
#define _LCDDATA19_S24C2_POSITION                           0x0
#define _LCDDATA19_S24C2_SIZE                               0x1
#define _LCDDATA19_S24C2_LENGTH                             0x1
#define _LCDDATA19_S24C2_MASK                               0x1
#define _LCDDATA19_S25C2_POSN                               0x1
#define _LCDDATA19_S25C2_POSITION                           0x1
#define _LCDDATA19_S25C2_SIZE                               0x1
#define _LCDDATA19_S25C2_LENGTH                             0x1
#define _LCDDATA19_S25C2_MASK                               0x2
#define _LCDDATA19_S26C2_POSN                               0x2
#define _LCDDATA19_S26C2_POSITION                           0x2
#define _LCDDATA19_S26C2_SIZE                               0x1
#define _LCDDATA19_S26C2_LENGTH                             0x1
#define _LCDDATA19_S26C2_MASK                               0x4
#define _LCDDATA19_S27C2_POSN                               0x3
#define _LCDDATA19_S27C2_POSITION                           0x3
#define _LCDDATA19_S27C2_SIZE                               0x1
#define _LCDDATA19_S27C2_LENGTH                             0x1
#define _LCDDATA19_S27C2_MASK                               0x8
#define _LCDDATA19_S28C2_POSN                               0x4
#define _LCDDATA19_S28C2_POSITION                           0x4
#define _LCDDATA19_S28C2_SIZE                               0x1
#define _LCDDATA19_S28C2_LENGTH                             0x1
#define _LCDDATA19_S28C2_MASK                               0x10
#define _LCDDATA19_S29C2_POSN                               0x5
#define _LCDDATA19_S29C2_POSITION                           0x5
#define _LCDDATA19_S29C2_SIZE                               0x1
#define _LCDDATA19_S29C2_LENGTH                             0x1
#define _LCDDATA19_S29C2_MASK                               0x20
#define _LCDDATA19_S30C2_POSN                               0x6
#define _LCDDATA19_S30C2_POSITION                           0x6
#define _LCDDATA19_S30C2_SIZE                               0x1
#define _LCDDATA19_S30C2_LENGTH                             0x1
#define _LCDDATA19_S30C2_MASK                               0x40
#define _LCDDATA19_S31C2_POSN                               0x7
#define _LCDDATA19_S31C2_POSITION                           0x7
#define _LCDDATA19_S31C2_SIZE                               0x1
#define _LCDDATA19_S31C2_LENGTH                             0x1
#define _LCDDATA19_S31C2_MASK                               0x80
#define _LCDDATA19_T3CKPS019_POSN                           0x4
#define _LCDDATA19_T3CKPS019_POSITION                       0x4
#define _LCDDATA19_T3CKPS019_SIZE                           0x1
#define _LCDDATA19_T3CKPS019_LENGTH                         0x1
#define _LCDDATA19_T3CKPS019_MASK                           0x10
#define _LCDDATA19_T3CKPS119_POSN                           0x5
#define _LCDDATA19_T3CKPS119_POSITION                       0x5
#define _LCDDATA19_T3CKPS119_SIZE                           0x1
#define _LCDDATA19_T3CKPS119_LENGTH                         0x1
#define _LCDDATA19_T3CKPS119_MASK                           0x20
#define _LCDDATA19_TMR3CS019_POSN                           0x6
#define _LCDDATA19_TMR3CS019_POSITION                       0x6
#define _LCDDATA19_TMR3CS019_SIZE                           0x1
#define _LCDDATA19_TMR3CS019_LENGTH                         0x1
#define _LCDDATA19_TMR3CS019_MASK                           0x40
#define _LCDDATA19_TMR3CS119_POSN                           0x7
#define _LCDDATA19_TMR3CS119_POSITION                       0x7
#define _LCDDATA19_TMR3CS119_SIZE                           0x1
#define _LCDDATA19_TMR3CS119_LENGTH                         0x1
#define _LCDDATA19_TMR3CS119_MASK                           0x80

