MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0xEA4);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 0EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C2                  :1;
        unsigned S49C2                  :1;
        unsigned S50C2                  :1;
        unsigned S51C2                  :1;
        unsigned S52C2                  :1;
        unsigned S53C2                  :1;
        unsigned S54C2                  :1;
        unsigned S55C2                  :1;
    };
} LCDDATA22bits_t;
extern volatile LCDDATA22bits_t LCDDATA22bits __at(0xEA4);
// bitfield macros
#define _LCDDATA22_S48C2_POSN                               0x0
#define _LCDDATA22_S48C2_POSITION                           0x0
#define _LCDDATA22_S48C2_SIZE                               0x1
#define _LCDDATA22_S48C2_LENGTH                             0x1
#define _LCDDATA22_S48C2_MASK                               0x1
#define _LCDDATA22_S49C2_POSN                               0x1
#define _LCDDATA22_S49C2_POSITION                           0x1
#define _LCDDATA22_S49C2_SIZE                               0x1
#define _LCDDATA22_S49C2_LENGTH                             0x1
#define _LCDDATA22_S49C2_MASK                               0x2
#define _LCDDATA22_S50C2_POSN                               0x2
#define _LCDDATA22_S50C2_POSITION                           0x2
#define _LCDDATA22_S50C2_SIZE                               0x1
#define _LCDDATA22_S50C2_LENGTH                             0x1
#define _LCDDATA22_S50C2_MASK                               0x4
#define _LCDDATA22_S51C2_POSN                               0x3
#define _LCDDATA22_S51C2_POSITION                           0x3
#define _LCDDATA22_S51C2_SIZE                               0x1
#define _LCDDATA22_S51C2_LENGTH                             0x1
#define _LCDDATA22_S51C2_MASK                               0x8
#define _LCDDATA22_S52C2_POSN                               0x4
#define _LCDDATA22_S52C2_POSITION                           0x4
#define _LCDDATA22_S52C2_SIZE                               0x1
#define _LCDDATA22_S52C2_LENGTH                             0x1
#define _LCDDATA22_S52C2_MASK                               0x10
#define _LCDDATA22_S53C2_POSN                               0x5
#define _LCDDATA22_S53C2_POSITION                           0x5
#define _LCDDATA22_S53C2_SIZE                               0x1
#define _LCDDATA22_S53C2_LENGTH                             0x1
#define _LCDDATA22_S53C2_MASK                               0x20
#define _LCDDATA22_S54C2_POSN                               0x6
#define _LCDDATA22_S54C2_POSITION                           0x6
#define _LCDDATA22_S54C2_SIZE                               0x1
#define _LCDDATA22_S54C2_LENGTH                             0x1
#define _LCDDATA22_S54C2_MASK                               0x40
#define _LCDDATA22_S55C2_POSN                               0x7
#define _LCDDATA22_S55C2_POSITION                           0x7
#define _LCDDATA22_S55C2_SIZE                               0x1
#define _LCDDATA22_S55C2_LENGTH                             0x1
#define _LCDDATA22_S55C2_MASK                               0x80

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
extern volatile unsigned char           LCDDATA23           __at(0xEA5);
#ifndef _LIB_BUILD
asm("LCDDATA23 equ 0EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C2                  :1;
        unsigned S57C2                  :1;
        unsigned S58C2                  :1;
        unsigned S59C2                  :1;
        unsigned S60C2                  :1;
        unsigned S61C2                  :1;
        unsigned S62C2                  :1;
        unsigned S63C2                  :1;
    };
} LCDDATA23bits_t;
extern volatile LCDDATA23bits_t LCDDATA23bits __at(0xEA5);
// bitfield macros
#define _LCDDATA23_S56C2_POSN                               0x0
#define _LCDDATA23_S56C2_POSITION                           0x0
#define _LCDDATA23_S56C2_SIZE                               0x1
#define _LCDDATA23_S56C2_LENGTH                             0x1
#define _LCDDATA23_S56C2_MASK                               0x1
#define _LCDDATA23_S57C2_POSN                               0x1
#define _LCDDATA23_S57C2_POSITION                           0x1
#define _LCDDATA23_S57C2_SIZE                               0x1
#define _LCDDATA23_S57C2_LENGTH                             0x1
#define _LCDDATA23_S57C2_MASK                               0x2
#define _LCDDATA23_S58C2_POSN                               0x2
#define _LCDDATA23_S58C2_POSITION                           0x2
#define _LCDDATA23_S58C2_SIZE                               0x1
#define _LCDDATA23_S58C2_LENGTH                             0x1
#define _LCDDATA23_S58C2_MASK                               0x4
#define _LCDDATA23_S59C2_POSN                               0x3
#define _LCDDATA23_S59C2_POSITION                           0x3
#define _LCDDATA23_S59C2_SIZE                               0x1
#define _LCDDATA23_S59C2_LENGTH                             0x1
#define _LCDDATA23_S59C2_MASK                               0x8
#define _LCDDATA23_S60C2_POSN                               0x4
#define _LCDDATA23_S60C2_POSITION                           0x4
#define _LCDDATA23_S60C2_SIZE                               0x1
#define _LCDDATA23_S60C2_LENGTH                             0x1
#define _LCDDATA23_S60C2_MASK                               0x10
#define _LCDDATA23_S61C2_POSN                               0x5
#define _LCDDATA23_S61C2_POSITION                           0x5
#define _LCDDATA23_S61C2_SIZE                               0x1
#define _LCDDATA23_S61C2_LENGTH                             0x1
#define _LCDDATA23_S61C2_MASK                               0x20
#define _LCDDATA23_S62C2_POSN                               0x6
#define _LCDDATA23_S62C2_POSITION                           0x6
#define _LCDDATA23_S62C2_SIZE                               0x1
#define _LCDDATA23_S62C2_LENGTH                             0x1
#define _LCDDATA23_S62C2_MASK                               0x40
#define _LCDDATA23_S63C2_POSN                               0x7
#define _LCDDATA23_S63C2_POSITION                           0x7
#define _LCDDATA23_S63C2_SIZE                               0x1
#define _LCDDATA23_S63C2_LENGTH                             0x1
#define _LCDDATA23_S63C2_MASK                               0x80

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
extern volatile unsigned char           LCDDATA24           __at(0xEA6);
#ifndef _LIB_BUILD
asm("LCDDATA24 equ 0EA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C3                  :1;
        unsigned S01C3                  :1;
        unsigned S02C3                  :1;
        unsigned S03C3                  :1;
        unsigned S04C3                  :1;
        unsigned S05C3                  :1;
        unsigned S06C3                  :1;
        unsigned S07C3                  :1;
    };
} LCDDATA24bits_t;
