MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
extern volatile LCDDATA34bits_t LCDDATA34bits __at(0xEB0);
// bitfield macros
#define _LCDDATA34_S16C4_POSN                               0x0
#define _LCDDATA34_S16C4_POSITION                           0x0
#define _LCDDATA34_S16C4_SIZE                               0x1
#define _LCDDATA34_S16C4_LENGTH                             0x1
#define _LCDDATA34_S16C4_MASK                               0x1
#define _LCDDATA34_S17C4_POSN                               0x1
#define _LCDDATA34_S17C4_POSITION                           0x1
#define _LCDDATA34_S17C4_SIZE                               0x1
#define _LCDDATA34_S17C4_LENGTH                             0x1
#define _LCDDATA34_S17C4_MASK                               0x2
#define _LCDDATA34_S18C4_POSN                               0x2
#define _LCDDATA34_S18C4_POSITION                           0x2
#define _LCDDATA34_S18C4_SIZE                               0x1
#define _LCDDATA34_S18C4_LENGTH                             0x1
#define _LCDDATA34_S18C4_MASK                               0x4
#define _LCDDATA34_S19C4_POSN                               0x3
#define _LCDDATA34_S19C4_POSITION                           0x3
#define _LCDDATA34_S19C4_SIZE                               0x1
#define _LCDDATA34_S19C4_LENGTH                             0x1
#define _LCDDATA34_S19C4_MASK                               0x8
#define _LCDDATA34_S20C4_POSN                               0x4
#define _LCDDATA34_S20C4_POSITION                           0x4
#define _LCDDATA34_S20C4_SIZE                               0x1
#define _LCDDATA34_S20C4_LENGTH                             0x1
#define _LCDDATA34_S20C4_MASK                               0x10
#define _LCDDATA34_S21C4_POSN                               0x5
#define _LCDDATA34_S21C4_POSITION                           0x5
#define _LCDDATA34_S21C4_SIZE                               0x1
#define _LCDDATA34_S21C4_LENGTH                             0x1
#define _LCDDATA34_S21C4_MASK                               0x20
#define _LCDDATA34_S22C4_POSN                               0x6
#define _LCDDATA34_S22C4_POSITION                           0x6
#define _LCDDATA34_S22C4_SIZE                               0x1
#define _LCDDATA34_S22C4_LENGTH                             0x1
#define _LCDDATA34_S22C4_MASK                               0x40
#define _LCDDATA34_S23C4_POSN                               0x7
#define _LCDDATA34_S23C4_POSITION                           0x7
#define _LCDDATA34_S23C4_SIZE                               0x1
#define _LCDDATA34_S23C4_LENGTH                             0x1
#define _LCDDATA34_S23C4_MASK                               0x80

// Register: LCDDATA35
#define LCDDATA35 LCDDATA35
extern volatile unsigned char           LCDDATA35           __at(0xEB1);
#ifndef _LIB_BUILD
asm("LCDDATA35 equ 0EB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C4                  :1;
        unsigned S25C4                  :1;
        unsigned S26C4                  :1;
        unsigned S27C4                  :1;
        unsigned S28C4                  :1;
        unsigned S29C4                  :1;
        unsigned S30C4                  :1;
        unsigned S31C4                  :1;
    };
} LCDDATA35bits_t;
extern volatile LCDDATA35bits_t LCDDATA35bits __at(0xEB1);
// bitfield macros
#define _LCDDATA35_S24C4_POSN                               0x0
#define _LCDDATA35_S24C4_POSITION                           0x0
#define _LCDDATA35_S24C4_SIZE                               0x1
#define _LCDDATA35_S24C4_LENGTH                             0x1
#define _LCDDATA35_S24C4_MASK                               0x1
#define _LCDDATA35_S25C4_POSN                               0x1
#define _LCDDATA35_S25C4_POSITION                           0x1
#define _LCDDATA35_S25C4_SIZE                               0x1
#define _LCDDATA35_S25C4_LENGTH                             0x1
#define _LCDDATA35_S25C4_MASK                               0x2
#define _LCDDATA35_S26C4_POSN                               0x2
#define _LCDDATA35_S26C4_POSITION                           0x2
#define _LCDDATA35_S26C4_SIZE                               0x1
#define _LCDDATA35_S26C4_LENGTH                             0x1
#define _LCDDATA35_S26C4_MASK                               0x4
#define _LCDDATA35_S27C4_POSN                               0x3
#define _LCDDATA35_S27C4_POSITION                           0x3
#define _LCDDATA35_S27C4_SIZE                               0x1
#define _LCDDATA35_S27C4_LENGTH                             0x1
#define _LCDDATA35_S27C4_MASK                               0x8
#define _LCDDATA35_S28C4_POSN                               0x4
#define _LCDDATA35_S28C4_POSITION                           0x4
#define _LCDDATA35_S28C4_SIZE                               0x1
#define _LCDDATA35_S28C4_LENGTH                             0x1
#define _LCDDATA35_S28C4_MASK                               0x10
#define _LCDDATA35_S29C4_POSN                               0x5
#define _LCDDATA35_S29C4_POSITION                           0x5
#define _LCDDATA35_S29C4_SIZE                               0x1
#define _LCDDATA35_S29C4_LENGTH                             0x1
#define _LCDDATA35_S29C4_MASK                               0x20
#define _LCDDATA35_S30C4_POSN                               0x6
#define _LCDDATA35_S30C4_POSITION                           0x6
#define _LCDDATA35_S30C4_SIZE                               0x1
#define _LCDDATA35_S30C4_LENGTH                             0x1
#define _LCDDATA35_S30C4_MASK                               0x40
#define _LCDDATA35_S31C4_POSN                               0x7
#define _LCDDATA35_S31C4_POSITION                           0x7
#define _LCDDATA35_S31C4_SIZE                               0x1
#define _LCDDATA35_S31C4_LENGTH                             0x1
#define _LCDDATA35_S31C4_MASK                               0x80

// Register: LCDDATA36
#define LCDDATA36 LCDDATA36
extern volatile unsigned char           LCDDATA36           __at(0xEB2);
#ifndef _LIB_BUILD
asm("LCDDATA36 equ 0EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C4                  :1;
        unsigned S33C4                  :1;
        unsigned S34C4                  :1;
        unsigned S35C4                  :1;
        unsigned S36C4                  :1;
        unsigned S37C4                  :1;
        unsigned S38C4                  :1;
        unsigned S39C4                  :1;
    };
} LCDDATA36bits_t;
extern volatile LCDDATA36bits_t LCDDATA36bits __at(0xEB2);
// bitfield macros
#define _LCDDATA36_S32C4_POSN                               0x0
#define _LCDDATA36_S32C4_POSITION                           0x0
#define _LCDDATA36_S32C4_SIZE                               0x1
#define _LCDDATA36_S32C4_LENGTH                             0x1
#define _LCDDATA36_S32C4_MASK                               0x1
#define _LCDDATA36_S33C4_POSN                               0x1
#define _LCDDATA36_S33C4_POSITION                           0x1
#define _LCDDATA36_S33C4_SIZE                               0x1
#define _LCDDATA36_S33C4_LENGTH                             0x1
#define _LCDDATA36_S33C4_MASK                               0x2
#define _LCDDATA36_S34C4_POSN                               0x2
#define _LCDDATA36_S34C4_POSITION                           0x2
#define _LCDDATA36_S34C4_SIZE                               0x1
#define _LCDDATA36_S34C4_LENGTH                             0x1
#define _LCDDATA36_S34C4_MASK                               0x4
#define _LCDDATA36_S35C4_POSN                               0x3
#define _LCDDATA36_S35C4_POSITION                           0x3
#define _LCDDATA36_S35C4_SIZE                               0x1
#define _LCDDATA36_S35C4_LENGTH                             0x1
#define _LCDDATA36_S35C4_MASK                               0x8
#define _LCDDATA36_S36C4_POSN                               0x4
#define _LCDDATA36_S36C4_POSITION                           0x4
#define _LCDDATA36_S36C4_SIZE                               0x1
#define _LCDDATA36_S36C4_LENGTH                             0x1
#define _LCDDATA36_S36C4_MASK                               0x10
#define _LCDDATA36_S37C4_POSN                               0x5
#define _LCDDATA36_S37C4_POSITION                           0x5
#define _LCDDATA36_S37C4_SIZE                               0x1
#define _LCDDATA36_S37C4_LENGTH                             0x1
#define _LCDDATA36_S37C4_MASK                               0x20
#define _LCDDATA36_S38C4_POSN                               0x6
#define _LCDDATA36_S38C4_POSITION                           0x6
#define _LCDDATA36_S38C4_SIZE                               0x1
#define _LCDDATA36_S38C4_LENGTH                             0x1
#define _LCDDATA36_S38C4_MASK                               0x40
#define _LCDDATA36_S39C4_POSN                               0x7
#define _LCDDATA36_S39C4_POSITION                           0x7
#define _LCDDATA36_S39C4_SIZE                               0x1
#define _LCDDATA36_S39C4_LENGTH                             0x1
#define _LCDDATA36_S39C4_MASK                               0x80

// Register: LCDDATA37
#define LCDDATA37 LCDDATA37
extern volatile unsigned char           LCDDATA37           __at(0xEB3);
#ifndef _LIB_BUILD
asm("LCDDATA37 equ 0EB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C4                  :1;
        unsigned S41C4                  :1;
        unsigned S42C4                  :1;
        unsigned S43C4                  :1;
        unsigned S44C4                  :1;
        unsigned S45C4                  :1;
        unsigned S46C4                  :1;
        unsigned S47C4                  :1;
    };
} LCDDATA37bits_t;
extern volatile LCDDATA37bits_t LCDDATA37bits __at(0xEB3);
// bitfield macros
#define _LCDDATA37_S40C4_POSN                               0x0
#define _LCDDATA37_S40C4_POSITION                           0x0
#define _LCDDATA37_S40C4_SIZE                               0x1
#define _LCDDATA37_S40C4_LENGTH                             0x1
#define _LCDDATA37_S40C4_MASK                               0x1
#define _LCDDATA37_S41C4_POSN                               0x1
#define _LCDDATA37_S41C4_POSITION                           0x1
#define _LCDDATA37_S41C4_SIZE                               0x1
#define _LCDDATA37_S41C4_LENGTH                             0x1
#define _LCDDATA37_S41C4_MASK                               0x2
#define _LCDDATA37_S42C4_POSN                               0x2
#define _LCDDATA37_S42C4_POSITION                           0x2
#define _LCDDATA37_S42C4_SIZE                               0x1
#define _LCDDATA37_S42C4_LENGTH                             0x1
#define _LCDDATA37_S42C4_MASK                               0x4
#define _LCDDATA37_S43C4_POSN                               0x3
#define _LCDDATA37_S43C4_POSITION                           0x3
#define _LCDDATA37_S43C4_SIZE                               0x1
#define _LCDDATA37_S43C4_LENGTH                             0x1
#define _LCDDATA37_S43C4_MASK                               0x8
#define _LCDDATA37_S44C4_POSN                               0x4
#define _LCDDATA37_S44C4_POSITION                           0x4
#define _LCDDATA37_S44C4_SIZE                               0x1
#define _LCDDATA37_S44C4_LENGTH                             0x1
#define _LCDDATA37_S44C4_MASK                               0x10
#define _LCDDATA37_S45C4_POSN                               0x5
#define _LCDDATA37_S45C4_POSITION                           0x5
#define _LCDDATA37_S45C4_SIZE                               0x1
#define _LCDDATA37_S45C4_LENGTH                             0x1
#define _LCDDATA37_S45C4_MASK                               0x20
#define _LCDDATA37_S46C4_POSN                               0x6
#define _LCDDATA37_S46C4_POSITION                           0x6
#define _LCDDATA37_S46C4_SIZE                               0x1
#define _LCDDATA37_S46C4_LENGTH                             0x1
#define _LCDDATA37_S46C4_MASK                               0x40
#define _LCDDATA37_S47C4_POSN                               0x7
#define _LCDDATA37_S47C4_POSITION                           0x7
#define _LCDDATA37_S47C4_SIZE                               0x1
#define _LCDDATA37_S47C4_LENGTH                             0x1
#define _LCDDATA37_S47C4_MASK                               0x80

// Register: LCDDATA38
#define LCDDATA38 LCDDATA38
extern volatile unsigned char           LCDDATA38           __at(0xEB4);
#ifndef _LIB_BUILD
asm("LCDDATA38 equ 0EB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C4                  :1;
        unsigned S49C4                  :1;
        unsigned S50C4                  :1;
        unsigned S51C4                  :1;
        unsigned S52C4                  :1;
        unsigned S53C4                  :1;
        unsigned S54C4                  :1;
        unsigned S55C4                  :1;
    };
} LCDDATA38bits_t;
extern volatile LCDDATA38bits_t LCDDATA38bits __at(0xEB4);
// bitfield macros
#define _LCDDATA38_S48C4_POSN                               0x0
#define _LCDDATA38_S48C4_POSITION                           0x0
#define _LCDDATA38_S48C4_SIZE                               0x1
#define _LCDDATA38_S48C4_LENGTH                             0x1
#define _LCDDATA38_S48C4_MASK                               0x1
#define _LCDDATA38_S49C4_POSN                               0x1
#define _LCDDATA38_S49C4_POSITION                           0x1
#define _LCDDATA38_S49C4_SIZE                               0x1
#define _LCDDATA38_S49C4_LENGTH                             0x1
#define _LCDDATA38_S49C4_MASK                               0x2
#define _LCDDATA38_S50C4_POSN                               0x2
#define _LCDDATA38_S50C4_POSITION                           0x2
#define _LCDDATA38_S50C4_SIZE                               0x1
#define _LCDDATA38_S50C4_LENGTH                             0x1
#define _LCDDATA38_S50C4_MASK                               0x4
#define _LCDDATA38_S51C4_POSN                               0x3
#define _LCDDATA38_S51C4_POSITION                           0x3
#define _LCDDATA38_S51C4_SIZE                               0x1
#define _LCDDATA38_S51C4_LENGTH                             0x1
#define _LCDDATA38_S51C4_MASK                               0x8
#define _LCDDATA38_S52C4_POSN                               0x4
#define _LCDDATA38_S52C4_POSITION                           0x4
#define _LCDDATA38_S52C4_SIZE                               0x1
#define _LCDDATA38_S52C4_LENGTH                             0x1
#define _LCDDATA38_S52C4_MASK                               0x10
#define _LCDDATA38_S53C4_POSN                               0x5
#define _LCDDATA38_S53C4_POSITION                           0x5
#define _LCDDATA38_S53C4_SIZE                               0x1
#define _LCDDATA38_S53C4_LENGTH                             0x1
#define _LCDDATA38_S53C4_MASK                               0x20
#define _LCDDATA38_S54C4_POSN                               0x6
#define _LCDDATA38_S54C4_POSITION                           0x6
#define _LCDDATA38_S54C4_SIZE                               0x1
#define _LCDDATA38_S54C4_LENGTH                             0x1
#define _LCDDATA38_S54C4_MASK                               0x40
#define _LCDDATA38_S55C4_POSN                               0x7
#define _LCDDATA38_S55C4_POSITION                           0x7
#define _LCDDATA38_S55C4_SIZE                               0x1
#define _LCDDATA38_S55C4_LENGTH                             0x1
#define _LCDDATA38_S55C4_MASK                               0x80

// Register: LCDDATA39
#define LCDDATA39 LCDDATA39
extern volatile unsigned char           LCDDATA39           __at(0xEB5);
#ifndef _LIB_BUILD
asm("LCDDATA39 equ 0EB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C4                  :1;
        unsigned S57C4                  :1;
        unsigned S58C4                  :1;
        unsigned S59C4                  :1;
        unsigned S60C4                  :1;
        unsigned S61C4                  :1;
        unsigned S62C4                  :1;
        unsigned S63C4                  :1;
    };
} LCDDATA39bits_t;
extern volatile LCDDATA39bits_t LCDDATA39bits __at(0xEB5);
// bitfield macros
#define _LCDDATA39_S56C4_POSN                               0x0
#define _LCDDATA39_S56C4_POSITION                           0x0
#define _LCDDATA39_S56C4_SIZE                               0x1
#define _LCDDATA39_S56C4_LENGTH                             0x1
#define _LCDDATA39_S56C4_MASK                               0x1
#define _LCDDATA39_S57C4_POSN                               0x1
#define _LCDDATA39_S57C4_POSITION                           0x1
#define _LCDDATA39_S57C4_SIZE                               0x1
#define _LCDDATA39_S57C4_LENGTH                             0x1
#define _LCDDATA39_S57C4_MASK                               0x2
#define _LCDDATA39_S58C4_POSN                               0x2
#define _LCDDATA39_S58C4_POSITION                           0x2
#define _LCDDATA39_S58C4_SIZE                               0x1
#define _LCDDATA39_S58C4_LENGTH                             0x1
#define _LCDDATA39_S58C4_MASK                               0x4
#define _LCDDATA39_S59C4_POSN                               0x3
#define _LCDDATA39_S59C4_POSITION                           0x3
#define _LCDDATA39_S59C4_SIZE                               0x1
#define _LCDDATA39_S59C4_LENGTH                             0x1
#define _LCDDATA39_S59C4_MASK                               0x8
#define _LCDDATA39_S60C4_POSN                               0x4
#define _LCDDATA39_S60C4_POSITION                           0x4
#define _LCDDATA39_S60C4_SIZE                               0x1
#define _LCDDATA39_S60C4_LENGTH                             0x1
#define _LCDDATA39_S60C4_MASK                               0x10
#define _LCDDATA39_S61C4_POSN                               0x5
#define _LCDDATA39_S61C4_POSITION                           0x5
#define _LCDDATA39_S61C4_SIZE                               0x1
#define _LCDDATA39_S61C4_LENGTH                             0x1
#define _LCDDATA39_S61C4_MASK                               0x20
#define _LCDDATA39_S62C4_POSN                               0x6
#define _LCDDATA39_S62C4_POSITION                           0x6
#define _LCDDATA39_S62C4_SIZE                               0x1
#define _LCDDATA39_S62C4_LENGTH                             0x1
#define _LCDDATA39_S62C4_MASK                               0x40
#define _LCDDATA39_S63C4_POSN                               0x7
#define _LCDDATA39_S63C4_POSITION                           0x7
#define _LCDDATA39_S63C4_SIZE                               0x1
#define _LCDDATA39_S63C4_LENGTH                             0x1
#define _LCDDATA39_S63C4_MASK                               0x80

// Register: LCDDATA40
#define LCDDATA40 LCDDATA40
extern volatile unsigned char           LCDDATA40           __at(0xEB6);
#ifndef _LIB_BUILD
asm("LCDDATA40 equ 0EB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C5                  :1;
        unsigned S01C5                  :1;
        unsigned S02C5                  :1;
        unsigned S03C5                  :1;
        unsigned S04C5                  :1;
        unsigned S05C5                  :1;
        unsigned S06C5                  :1;
        unsigned S07C5                  :1;
    };
} LCDDATA40bits_t;
