MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
extern volatile RCREG1bits_t RCREG1bits __at(0xFAE);
// bitfield macros
#define _RCREG1_RCREG1_POSN                                 0x0
#define _RCREG1_RCREG1_POSITION                             0x0
#define _RCREG1_RCREG1_SIZE                                 0x8
#define _RCREG1_RCREG1_LENGTH                               0x8
#define _RCREG1_RCREG1_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RCREG1                 :8;
    };
} RCREGbits_t;
extern volatile RCREGbits_t RCREGbits __at(0xFAE);
// bitfield macros
#define _RCREG_RCREG1_POSN                                  0x0
#define _RCREG_RCREG1_POSITION                              0x0
#define _RCREG_RCREG1_SIZE                                  0x8
#define _RCREG_RCREG1_LENGTH                                0x8
#define _RCREG_RCREG1_MASK                                  0xFF

// Register: SPBRG1
#define SPBRG1 SPBRG1
extern volatile unsigned char           SPBRG1              __at(0xFAF);
#ifndef _LIB_BUILD
asm("SPBRG1 equ 0FAFh");
#endif
// aliases
extern volatile unsigned char           SPBRG               __at(0xFAF);
#ifndef _LIB_BUILD
asm("SPBRG equ 0FAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRG1                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRG1bits_t;
extern volatile SPBRG1bits_t SPBRG1bits __at(0xFAF);
// bitfield macros
#define _SPBRG1_SPBRG1_POSN                                 0x0
#define _SPBRG1_SPBRG1_POSITION                             0x0
#define _SPBRG1_SPBRG1_SIZE                                 0x8
#define _SPBRG1_SPBRG1_LENGTH                               0x8
#define _SPBRG1_SPBRG1_MASK                                 0xFF
#define _SPBRG1_BRG0_POSN                                   0x0
#define _SPBRG1_BRG0_POSITION                               0x0
#define _SPBRG1_BRG0_SIZE                                   0x1
#define _SPBRG1_BRG0_LENGTH                                 0x1
#define _SPBRG1_BRG0_MASK                                   0x1
#define _SPBRG1_BRG1_POSN                                   0x1
#define _SPBRG1_BRG1_POSITION                               0x1
#define _SPBRG1_BRG1_SIZE                                   0x1
#define _SPBRG1_BRG1_LENGTH                                 0x1
#define _SPBRG1_BRG1_MASK                                   0x2
#define _SPBRG1_BRG2_POSN                                   0x2
#define _SPBRG1_BRG2_POSITION                               0x2
#define _SPBRG1_BRG2_SIZE                                   0x1
#define _SPBRG1_BRG2_LENGTH                                 0x1
#define _SPBRG1_BRG2_MASK                                   0x4
#define _SPBRG1_BRG3_POSN                                   0x3
#define _SPBRG1_BRG3_POSITION                               0x3
#define _SPBRG1_BRG3_SIZE                                   0x1
#define _SPBRG1_BRG3_LENGTH                                 0x1
#define _SPBRG1_BRG3_MASK                                   0x8
#define _SPBRG1_BRG4_POSN                                   0x4
#define _SPBRG1_BRG4_POSITION                               0x4
#define _SPBRG1_BRG4_SIZE                                   0x1
#define _SPBRG1_BRG4_LENGTH                                 0x1
#define _SPBRG1_BRG4_MASK                                   0x10
#define _SPBRG1_BRG5_POSN                                   0x5
#define _SPBRG1_BRG5_POSITION                               0x5
#define _SPBRG1_BRG5_SIZE                                   0x1
#define _SPBRG1_BRG5_LENGTH                                 0x1
#define _SPBRG1_BRG5_MASK                                   0x20
#define _SPBRG1_BRG6_POSN                                   0x6
#define _SPBRG1_BRG6_POSITION                               0x6
#define _SPBRG1_BRG6_SIZE                                   0x1
#define _SPBRG1_BRG6_LENGTH                                 0x1
#define _SPBRG1_BRG6_MASK                                   0x40
#define _SPBRG1_BRG7_POSN                                   0x7
#define _SPBRG1_BRG7_POSITION                               0x7
#define _SPBRG1_BRG7_SIZE                                   0x1
#define _SPBRG1_BRG7_LENGTH                                 0x1
#define _SPBRG1_BRG7_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SPBRG1                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRGbits_t;
extern volatile SPBRGbits_t SPBRGbits __at(0xFAF);
// bitfield macros
#define _SPBRG_SPBRG1_POSN                                  0x0
#define _SPBRG_SPBRG1_POSITION                              0x0
#define _SPBRG_SPBRG1_SIZE                                  0x8
#define _SPBRG_SPBRG1_LENGTH                                0x8
#define _SPBRG_SPBRG1_MASK                                  0xFF
#define _SPBRG_BRG0_POSN                                    0x0
#define _SPBRG_BRG0_POSITION                                0x0
#define _SPBRG_BRG0_SIZE                                    0x1
#define _SPBRG_BRG0_LENGTH                                  0x1
#define _SPBRG_BRG0_MASK                                    0x1
#define _SPBRG_BRG1_POSN                                    0x1
#define _SPBRG_BRG1_POSITION                                0x1
#define _SPBRG_BRG1_SIZE                                    0x1
#define _SPBRG_BRG1_LENGTH                                  0x1
#define _SPBRG_BRG1_MASK                                    0x2
#define _SPBRG_BRG2_POSN                                    0x2
#define _SPBRG_BRG2_POSITION                                0x2
#define _SPBRG_BRG2_SIZE                                    0x1
#define _SPBRG_BRG2_LENGTH                                  0x1
#define _SPBRG_BRG2_MASK                                    0x4
#define _SPBRG_BRG3_POSN                                    0x3
#define _SPBRG_BRG3_POSITION                                0x3
#define _SPBRG_BRG3_SIZE                                    0x1
#define _SPBRG_BRG3_LENGTH                                  0x1
#define _SPBRG_BRG3_MASK                                    0x8
#define _SPBRG_BRG4_POSN                                    0x4
#define _SPBRG_BRG4_POSITION                                0x4
#define _SPBRG_BRG4_SIZE                                    0x1
#define _SPBRG_BRG4_LENGTH                                  0x1
#define _SPBRG_BRG4_MASK                                    0x10
#define _SPBRG_BRG5_POSN                                    0x5
#define _SPBRG_BRG5_POSITION                                0x5
#define _SPBRG_BRG5_SIZE                                    0x1
#define _SPBRG_BRG5_LENGTH                                  0x1
#define _SPBRG_BRG5_MASK                                    0x20
#define _SPBRG_BRG6_POSN                                    0x6
#define _SPBRG_BRG6_POSITION                                0x6
#define _SPBRG_BRG6_SIZE                                    0x1
#define _SPBRG_BRG6_LENGTH                                  0x1
#define _SPBRG_BRG6_MASK                                    0x40
#define _SPBRG_BRG7_POSN                                    0x7
#define _SPBRG_BRG7_POSITION                                0x7
#define _SPBRG_BRG7_SIZE                                    0x1
#define _SPBRG_BRG7_LENGTH                                  0x1
#define _SPBRG_BRG7_MASK                                    0x80

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0xFB0);
#ifndef _LIB_BUILD
asm("T3GCON equ 0FB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_T3DONE       :1;
    };
    struct {
        unsigned T3GSS                  :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nT3DONE          :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned TMR3GE                 :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned                        :1;
        unsigned T3GGO                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T3DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned nT3DONE                :1;
    };
} T3GCONbits_t;
