MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
extern volatile IPR5bits_t IPR5bits __at(0xFD2);
// bitfield macros
#define _IPR5_TMR4IP_POSN                                   0x0
#define _IPR5_TMR4IP_POSITION                               0x0
#define _IPR5_TMR4IP_SIZE                                   0x1
#define _IPR5_TMR4IP_LENGTH                                 0x1
#define _IPR5_TMR4IP_MASK                                   0x1
#define _IPR5_TMR5IP_POSN                                   0x1
#define _IPR5_TMR5IP_POSITION                               0x1
#define _IPR5_TMR5IP_SIZE                                   0x1
#define _IPR5_TMR5IP_LENGTH                                 0x1
#define _IPR5_TMR5IP_MASK                                   0x2
#define _IPR5_TMR6IP_POSN                                   0x2
#define _IPR5_TMR6IP_POSITION                               0x2
#define _IPR5_TMR6IP_SIZE                                   0x1
#define _IPR5_TMR6IP_LENGTH                                 0x1
#define _IPR5_TMR6IP_MASK                                   0x4
#define _IPR5_TMR8IP_POSN                                   0x4
#define _IPR5_TMR8IP_POSITION                               0x4
#define _IPR5_TMR8IP_SIZE                                   0x1
#define _IPR5_TMR8IP_LENGTH                                 0x1
#define _IPR5_TMR8IP_MASK                                   0x10
#define _IPR5_ACTLOCKIP_POSN                                0x5
#define _IPR5_ACTLOCKIP_POSITION                            0x5
#define _IPR5_ACTLOCKIP_SIZE                                0x1
#define _IPR5_ACTLOCKIP_LENGTH                              0x1
#define _IPR5_ACTLOCKIP_MASK                                0x20
#define _IPR5_ACTORSIP_POSN                                 0x6
#define _IPR5_ACTORSIP_POSITION                             0x6
#define _IPR5_ACTORSIP_SIZE                                 0x1
#define _IPR5_ACTORSIP_LENGTH                               0x1
#define _IPR5_ACTORSIP_MASK                                 0x40
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2
#define _IPR5_EVPOL15_POSN                                  0x4
#define _IPR5_EVPOL15_POSITION                              0x4
#define _IPR5_EVPOL15_SIZE                                  0x1
#define _IPR5_EVPOL15_LENGTH                                0x1
#define _IPR5_EVPOL15_MASK                                  0x10

// Register: OSCCON
#define OSCCON OSCCON
extern volatile unsigned char           OSCCON              __at(0xFD3);
#ifndef _LIB_BUILD
asm("OSCCON equ 0FD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NOSC                   :3;
        unsigned                        :1;
        unsigned COSC                   :3;
        unsigned IDLEN                  :1;
    };
    struct {
        unsigned NOSC0                  :1;
        unsigned NOSC1                  :1;
        unsigned NOSC2                  :1;
        unsigned                        :1;
        unsigned COSC0                  :1;
        unsigned COSC1                  :1;
        unsigned COSC2                  :1;
    };
    struct {
        unsigned SCS                    :1;
    };
} OSCCONbits_t;
extern volatile OSCCONbits_t OSCCONbits __at(0xFD3);
// bitfield macros
#define _OSCCON_NOSC_POSN                                   0x0
#define _OSCCON_NOSC_POSITION                               0x0
#define _OSCCON_NOSC_SIZE                                   0x3
#define _OSCCON_NOSC_LENGTH                                 0x3
#define _OSCCON_NOSC_MASK                                   0x7
#define _OSCCON_COSC_POSN                                   0x4
#define _OSCCON_COSC_POSITION                               0x4
#define _OSCCON_COSC_SIZE                                   0x3
#define _OSCCON_COSC_LENGTH                                 0x3
#define _OSCCON_COSC_MASK                                   0x70
#define _OSCCON_IDLEN_POSN                                  0x7
#define _OSCCON_IDLEN_POSITION                              0x7
#define _OSCCON_IDLEN_SIZE                                  0x1
#define _OSCCON_IDLEN_LENGTH                                0x1
#define _OSCCON_IDLEN_MASK                                  0x80
#define _OSCCON_NOSC0_POSN                                  0x0
#define _OSCCON_NOSC0_POSITION                              0x0
#define _OSCCON_NOSC0_SIZE                                  0x1
#define _OSCCON_NOSC0_LENGTH                                0x1
#define _OSCCON_NOSC0_MASK                                  0x1
#define _OSCCON_NOSC1_POSN                                  0x1
#define _OSCCON_NOSC1_POSITION                              0x1
#define _OSCCON_NOSC1_SIZE                                  0x1
#define _OSCCON_NOSC1_LENGTH                                0x1
#define _OSCCON_NOSC1_MASK                                  0x2
#define _OSCCON_NOSC2_POSN                                  0x2
#define _OSCCON_NOSC2_POSITION                              0x2
#define _OSCCON_NOSC2_SIZE                                  0x1
#define _OSCCON_NOSC2_LENGTH                                0x1
#define _OSCCON_NOSC2_MASK                                  0x4
#define _OSCCON_COSC0_POSN                                  0x4
#define _OSCCON_COSC0_POSITION                              0x4
#define _OSCCON_COSC0_SIZE                                  0x1
#define _OSCCON_COSC0_LENGTH                                0x1
#define _OSCCON_COSC0_MASK                                  0x10
#define _OSCCON_COSC1_POSN                                  0x5
#define _OSCCON_COSC1_POSITION                              0x5
#define _OSCCON_COSC1_SIZE                                  0x1
#define _OSCCON_COSC1_LENGTH                                0x1
#define _OSCCON_COSC1_MASK                                  0x20
#define _OSCCON_COSC2_POSN                                  0x6
#define _OSCCON_COSC2_POSITION                              0x6
#define _OSCCON_COSC2_SIZE                                  0x1
#define _OSCCON_COSC2_LENGTH                                0x1
#define _OSCCON_COSC2_MASK                                  0x40
#define _OSCCON_SCS_POSN                                    0x0
#define _OSCCON_SCS_POSITION                                0x0
#define _OSCCON_SCS_SIZE                                    0x1
#define _OSCCON_SCS_LENGTH                                  0x1
#define _OSCCON_SCS_MASK                                    0x1

// Register: T0CON
#define T0CON T0CON
extern volatile unsigned char           T0CON               __at(0xFD5);
#ifndef _LIB_BUILD
asm("T0CON equ 0FD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0PS                   :3;
        unsigned PSA                    :1;
        unsigned T0CS                   :2;
        unsigned T08BIT                 :1;
        unsigned TMR0ON                 :1;
    };
    struct {
        unsigned T0PS0                  :1;
        unsigned T0PS1                  :1;
        unsigned T0PS2                  :1;
        unsigned                        :1;
        unsigned T0CS0                  :1;
        unsigned T0CS1                  :1;
    };
} T0CONbits_t;
extern volatile T0CONbits_t T0CONbits __at(0xFD5);
// bitfield macros
#define _T0CON_T0PS_POSN                                    0x0
#define _T0CON_T0PS_POSITION                                0x0
#define _T0CON_T0PS_SIZE                                    0x3
#define _T0CON_T0PS_LENGTH                                  0x3
#define _T0CON_T0PS_MASK                                    0x7
#define _T0CON_PSA_POSN                                     0x3
#define _T0CON_PSA_POSITION                                 0x3
#define _T0CON_PSA_SIZE                                     0x1
#define _T0CON_PSA_LENGTH                                   0x1
#define _T0CON_PSA_MASK                                     0x8
#define _T0CON_T0CS_POSN                                    0x4
#define _T0CON_T0CS_POSITION                                0x4
#define _T0CON_T0CS_SIZE                                    0x2
#define _T0CON_T0CS_LENGTH                                  0x2
#define _T0CON_T0CS_MASK                                    0x30
#define _T0CON_T08BIT_POSN                                  0x6
#define _T0CON_T08BIT_POSITION                              0x6
#define _T0CON_T08BIT_SIZE                                  0x1
#define _T0CON_T08BIT_LENGTH                                0x1
#define _T0CON_T08BIT_MASK                                  0x40
#define _T0CON_TMR0ON_POSN                                  0x7
#define _T0CON_TMR0ON_POSITION                              0x7
#define _T0CON_TMR0ON_SIZE                                  0x1
#define _T0CON_TMR0ON_LENGTH                                0x1
#define _T0CON_TMR0ON_MASK                                  0x80
#define _T0CON_T0PS0_POSN                                   0x0
#define _T0CON_T0PS0_POSITION                               0x0
#define _T0CON_T0PS0_SIZE                                   0x1
#define _T0CON_T0PS0_LENGTH                                 0x1
#define _T0CON_T0PS0_MASK                                   0x1
#define _T0CON_T0PS1_POSN                                   0x1
#define _T0CON_T0PS1_POSITION                               0x1
#define _T0CON_T0PS1_SIZE                                   0x1
#define _T0CON_T0PS1_LENGTH                                 0x1
#define _T0CON_T0PS1_MASK                                   0x2
#define _T0CON_T0PS2_POSN                                   0x2
#define _T0CON_T0PS2_POSITION                               0x2
#define _T0CON_T0PS2_SIZE                                   0x1
#define _T0CON_T0PS2_LENGTH                                 0x1
#define _T0CON_T0PS2_MASK                                   0x4
#define _T0CON_T0CS0_POSN                                   0x4
#define _T0CON_T0CS0_POSITION                               0x4
#define _T0CON_T0CS0_SIZE                                   0x1
#define _T0CON_T0CS0_LENGTH                                 0x1
#define _T0CON_T0CS0_MASK                                   0x10
#define _T0CON_T0CS1_POSN                                   0x5
#define _T0CON_T0CS1_POSITION                               0x5
#define _T0CON_T0CS1_SIZE                                   0x1
#define _T0CON_T0CS1_LENGTH                                 0x1
#define _T0CON_T0CS1_MASK                                   0x20

