MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
// LATG<LATG0>
extern volatile __bit                   LATG0               __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 LATG0_bit           _BIT_ACCESS(LATG,0)
// LATG<LATG1>
extern volatile __bit                   LATG1               __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 LATG1_bit           _BIT_ACCESS(LATG,1)
// LATG<LATG2>
extern volatile __bit                   LATG2               __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 LATG2_bit           _BIT_ACCESS(LATG,2)
// LATG<LATG3>
extern volatile __bit                   LATG3               __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 LATG3_bit           _BIT_ACCESS(LATG,3)
// LATG<LATG4>
extern volatile __bit                   LATG4               __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 LATG4_bit           _BIT_ACCESS(LATG,4)
// LATVP<LATVP0>
extern volatile __bit                   LATVP0              __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 LATVP0_bit          _BIT_ACCESS(LATVP,0)
// LATVP<LATVP1>
extern volatile __bit                   LATVP1              __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 LATVP1_bit          _BIT_ACCESS(LATVP,1)
// LATVP<LATVP2>
extern volatile __bit                   LATVP2              __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 LATVP2_bit          _BIT_ACCESS(LATVP,2)
// LATVP<LATVP3>
extern volatile __bit                   LATVP3              __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 LATVP3_bit          _BIT_ACCESS(LATVP,3)
// LATVP<LATVP4>
extern volatile __bit                   LATVP4              __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 LATVP4_bit          _BIT_ACCESS(LATVP,4)
// LATVP<LATVP5>
extern volatile __bit                   LATVP5              __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 LATVP5_bit          _BIT_ACCESS(LATVP,5)
// LATVP<LATVP6>
extern volatile __bit                   LATVP6              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 LATVP6_bit          _BIT_ACCESS(LATVP,6)
// LATVP<LATVP7>
extern volatile __bit                   LATVP7              __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 LATVP7_bit          _BIT_ACCESS(LATVP,7)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LB3_bit             _BIT_ACCESS(LATB,3)
// LATB<LB4>
extern volatile __bit                   LB4                 __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LB4_bit             _BIT_ACCESS(LATB,4)
// LATB<LB5>
extern volatile __bit                   LB5                 __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LB5_bit             _BIT_ACCESS(LATB,5)
// LATB<LB6>
extern volatile __bit                   LB6                 __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 LB6_bit             _BIT_ACCESS(LATB,6)
// LATB<LB7>
extern volatile __bit                   LB7                 __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 LB7_bit             _BIT_ACCESS(LATB,7)
// LATC<LC0>
extern volatile __bit                   LC0                 __at(0x7C58);	// @ (0xF8B * 8 + 0)
#define                                 LC0_bit             _BIT_ACCESS(LATC,0)
// LATC<LC1>
extern volatile __bit                   LC1                 __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 LC1_bit             _BIT_ACCESS(LATC,1)
// LATC<LC2>
extern volatile __bit                   LC2                 __at(0x7C5A);	// @ (0xF8B * 8 + 2)
#define                                 LC2_bit             _BIT_ACCESS(LATC,2)
// LATC<LC3>
extern volatile __bit                   LC3                 __at(0x7C5B);	// @ (0xF8B * 8 + 3)
#define                                 LC3_bit             _BIT_ACCESS(LATC,3)
// LATC<LC4>
extern volatile __bit                   LC4                 __at(0x7C5C);	// @ (0xF8B * 8 + 4)
#define                                 LC4_bit             _BIT_ACCESS(LATC,4)
// LATC<LC5>
extern volatile __bit                   LC5                 __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LC5_bit             _BIT_ACCESS(LATC,5)
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LC6_bit             _BIT_ACCESS(LATC,6)
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LC7_bit             _BIT_ACCESS(LATC,7)
// LCDPS<LCDA>
extern volatile __bit                   LCDA                __at(0x76D5);	// @ (0xEDA * 8 + 5)
#define                                 LCDA_bit            _BIT_ACCESS(LCDPS,5)
// LCDREF<LCDCST0>
extern volatile __bit                   LCDCST0             __at(0x76BB);	// @ (0xED7 * 8 + 3)
#define                                 LCDCST0_bit         _BIT_ACCESS(LCDREF,3)
// LCDREF<LCDCST1>
extern volatile __bit                   LCDCST1             __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 LCDCST1_bit         _BIT_ACCESS(LCDREF,4)
// LCDREF<LCDCST2>
extern volatile __bit                   LCDCST2             __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 LCDCST2_bit         _BIT_ACCESS(LCDREF,5)
// LCDCON<LCDEN>
extern volatile __bit                   LCDEN               __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 LCDEN_bit           _BIT_ACCESS(LCDCON,7)
// PIE3<LCDIE>
extern volatile __bit                   LCDIE               __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 LCDIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<LCDIF>
extern volatile __bit                   LCDIF               __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 LCDIF_bit           _BIT_ACCESS(PIR3,6)
// IPR3<LCDIP>
extern volatile __bit                   LCDIP               __at(0x7D2E);	// @ (0xFA5 * 8 + 6)
#define                                 LCDIP_bit           _BIT_ACCESS(IPR3,6)
// LCDREF<LCDIRE>
extern volatile __bit                   LCDIRE              __at(0x76BF);	// @ (0xED7 * 8 + 7)
#define                                 LCDIRE_bit          _BIT_ACCESS(LCDREF,7)
// PMD3<LCDMD>
extern volatile __bit                   LCDMD               __at(0x778B);	// @ (0xEF1 * 8 + 3)
#define                                 LCDMD_bit           _BIT_ACCESS(PMD3,3)
// LATD<LD0>
extern volatile __bit                   LD0                 __at(0x7C60);	// @ (0xF8C * 8 + 0)
#define                                 LD0_bit             _BIT_ACCESS(LATD,0)
// LATD<LD1>
extern volatile __bit                   LD1                 __at(0x7C61);	// @ (0xF8C * 8 + 1)
#define                                 LD1_bit             _BIT_ACCESS(LATD,1)
// LATD<LD2>
extern volatile __bit                   LD2                 __at(0x7C62);	// @ (0xF8C * 8 + 2)
#define                                 LD2_bit             _BIT_ACCESS(LATD,2)
// LATD<LD3>
extern volatile __bit                   LD3                 __at(0x7C63);	// @ (0xF8C * 8 + 3)
#define                                 LD3_bit             _BIT_ACCESS(LATD,3)
// LATD<LD4>
extern volatile __bit                   LD4                 __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LD4_bit             _BIT_ACCESS(LATD,4)
// LATD<LD5>
extern volatile __bit                   LD5                 __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LD5_bit             _BIT_ACCESS(LATD,5)
// LATD<LD6>
extern volatile __bit                   LD6                 __at(0x7C66);	// @ (0xF8C * 8 + 6)
#define                                 LD6_bit             _BIT_ACCESS(LATD,6)
// LATD<LD7>
extern volatile __bit                   LD7                 __at(0x7C67);	// @ (0xF8C * 8 + 7)
#define                                 LD7_bit             _BIT_ACCESS(LATD,7)
// LATE<LE0>
extern volatile __bit                   LE0                 __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 LE0_bit             _BIT_ACCESS(LATE,0)
// LATE<LE1>
extern volatile __bit                   LE1                 __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 LE1_bit             _BIT_ACCESS(LATE,1)
// LATE<LE2>
extern volatile __bit                   LE2                 __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 LE2_bit             _BIT_ACCESS(LATE,2)
// LATE<LE3>
extern volatile __bit                   LE3                 __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 LE3_bit             _BIT_ACCESS(LATE,3)
// LATE<LE4>
extern volatile __bit                   LE4                 __at(0x7C6C);	// @ (0xF8D * 8 + 4)
#define                                 LE4_bit             _BIT_ACCESS(LATE,4)
// LATE<LE5>
extern volatile __bit                   LE5                 __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 LE5_bit             _BIT_ACCESS(LATE,5)
// LATE<LE6>
extern volatile __bit                   LE6                 __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 LE6_bit             _BIT_ACCESS(LATE,6)
// LATE<LE7>
extern volatile __bit                   LE7                 __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 LE7_bit             _BIT_ACCESS(LATE,7)
// LATF<LF2>
extern volatile __bit                   LF2                 __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 LF2_bit             _BIT_ACCESS(LATF,2)
// LATF<LF3>
extern volatile __bit                   LF3                 __at(0x7C73);	// @ (0xF8E * 8 + 3)
#define                                 LF3_bit             _BIT_ACCESS(LATF,3)
// LATF<LF4>
extern volatile __bit                   LF4                 __at(0x7C74);	// @ (0xF8E * 8 + 4)
#define                                 LF4_bit             _BIT_ACCESS(LATF,4)
// LATF<LF5>
extern volatile __bit                   LF5                 __at(0x7C75);	// @ (0xF8E * 8 + 5)
#define                                 LF5_bit             _BIT_ACCESS(LATF,5)
// LATF<LF6>
extern volatile __bit                   LF6                 __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 LF6_bit             _BIT_ACCESS(LATF,6)
// LATF<LF7>
extern volatile __bit                   LF7                 __at(0x7C77);	// @ (0xF8E * 8 + 7)
#define                                 LF7_bit             _BIT_ACCESS(LATF,7)
// LATG<LG0>
extern volatile __bit                   LG0                 __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 LG0_bit             _BIT_ACCESS(LATG,0)
// LATG<LG1>
extern volatile __bit                   LG1                 __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 LG1_bit             _BIT_ACCESS(LATG,1)
// LATG<LG2>
extern volatile __bit                   LG2                 __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 LG2_bit             _BIT_ACCESS(LATG,2)
// LATG<LG3>
extern volatile __bit                   LG3                 __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 LG3_bit             _BIT_ACCESS(LATG,3)
// LATG<LG4>
extern volatile __bit                   LG4                 __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 LG4_bit             _BIT_ACCESS(LATG,4)
// LCDCON<LMUX0>
extern volatile __bit                   LMUX0               __at(0x76C8);	// @ (0xED9 * 8 + 0)
#define                                 LMUX0_bit           _BIT_ACCESS(LCDCON,0)
// LCDCON<LMUX1>
extern volatile __bit                   LMUX1               __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 LMUX1_bit           _BIT_ACCESS(LCDCON,1)
// LCDCON<LMUX2>
extern volatile __bit                   LMUX2               __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 LMUX2_bit           _BIT_ACCESS(LCDCON,2)
// OSCCON2<LOCK>
extern volatile __bit                   LOCK                __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 LOCK_bit            _BIT_ACCESS(OSCCON2,5)
// LCDPS<LP0>
extern volatile __bit                   LP0                 __at(0x76D0);	// @ (0xEDA * 8 + 0)
#define                                 LP0_bit             _BIT_ACCESS(LCDPS,0)
// LCDPS<LP1>
extern volatile __bit                   LP1                 __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 LP1_bit             _BIT_ACCESS(LCDPS,1)
// LCDPS<LP2>
extern volatile __bit                   LP2                 __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 LP2_bit             _BIT_ACCESS(LCDPS,2)
// LCDPS<LP3>
extern volatile __bit                   LP3                 __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 LP3_bit             _BIT_ACCESS(LCDPS,3)
// ADCON5H<LPENA>
extern volatile __bit                   LPENA               __at(0x744E);	// @ (0xE89 * 8 + 6)
#define                                 LPENA_bit           _BIT_ACCESS(ADCON5H,6)
// LCDRL<LRLAP0>
extern volatile __bit                   LRLAP0              __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 LRLAP0_bit          _BIT_ACCESS(LCDRL,6)
// LCDRL<LRLAP1>
extern volatile __bit                   LRLAP1              __at(0x76B7);	// @ (0xED6 * 8 + 7)
#define                                 LRLAP1_bit          _BIT_ACCESS(LCDRL,7)
// LCDRL<LRLAT0>
extern volatile __bit                   LRLAT0              __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 LRLAT0_bit          _BIT_ACCESS(LCDRL,0)
// LCDRL<LRLAT1>
extern volatile __bit                   LRLAT1              __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 LRLAT1_bit          _BIT_ACCESS(LCDRL,1)
// LCDRL<LRLAT2>
extern volatile __bit                   LRLAT2              __at(0x76B2);	// @ (0xED6 * 8 + 2)
#define                                 LRLAT2_bit          _BIT_ACCESS(LCDRL,2)
// LCDRL<LRLBP0>
extern volatile __bit                   LRLBP0              __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 LRLBP0_bit          _BIT_ACCESS(LCDRL,4)
// LCDRL<LRLBP1>
extern volatile __bit                   LRLBP1              __at(0x76B5);	// @ (0xED6 * 8 + 5)
#define                                 LRLBP1_bit          _BIT_ACCESS(LCDRL,5)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 LVDIN_bit           _BIT_ACCESS(PORTA,5)
// PMD4<LVDMD>
extern volatile __bit                   LVDMD               __at(0x7782);	// @ (0xEF0 * 8 + 2)
#define                                 LVDMD_bit           _BIT_ACCESS(PMD4,2)
// MDCON<MDBIT>
extern volatile __bit                   MDBIT               __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON,0)
// MDCARH<MDCH0>
extern volatile __bit                   MDCH0               __at(0x7768);	// @ (0xEED * 8 + 0)
#define                                 MDCH0_bit           _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCH1>
extern volatile __bit                   MDCH1               __at(0x7769);	// @ (0xEED * 8 + 1)
#define                                 MDCH1_bit           _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCH2>
extern volatile __bit                   MDCH2               __at(0x776A);	// @ (0xEED * 8 + 2)
#define                                 MDCH2_bit           _BIT_ACCESS(MDCARH,2)
// MDCARH<MDCH3>
extern volatile __bit                   MDCH3               __at(0x776B);	// @ (0xEED * 8 + 3)
#define                                 MDCH3_bit           _BIT_ACCESS(MDCARH,3)
// MDCARH<MDCHODIS>
extern volatile __bit                   MDCHODIS            __at(0x776F);	// @ (0xEED * 8 + 7)
#define                                 MDCHODIS_bit        _BIT_ACCESS(MDCARH,7)
// MDCARH<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x776E);	// @ (0xEED * 8 + 6)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCARH,6)
// MDCARH<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x776D);	// @ (0xEED * 8 + 5)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCARH,5)
// RPINR30_31<MDCIN1R0>
extern volatile __bit                   MDCIN1R0            __at(0x71C8);	// @ (0xE39 * 8 + 0)
#define                                 MDCIN1R0_bit        _BIT_ACCESS(RPINR30_31,0)
// RPINR30_31<MDCIN1R1>
extern volatile __bit                   MDCIN1R1            __at(0x71C9);	// @ (0xE39 * 8 + 1)
#define                                 MDCIN1R1_bit        _BIT_ACCESS(RPINR30_31,1)
// RPINR30_31<MDCIN1R2>
extern volatile __bit                   MDCIN1R2            __at(0x71CA);	// @ (0xE39 * 8 + 2)
#define                                 MDCIN1R2_bit        _BIT_ACCESS(RPINR30_31,2)
// RPINR30_31<MDCIN1R3>
extern volatile __bit                   MDCIN1R3            __at(0x71CB);	// @ (0xE39 * 8 + 3)
#define                                 MDCIN1R3_bit        _BIT_ACCESS(RPINR30_31,3)
// RPINR30_31<MDCIN2R0>
extern volatile __bit                   MDCIN2R0            __at(0x71CC);	// @ (0xE39 * 8 + 4)
#define                                 MDCIN2R0_bit        _BIT_ACCESS(RPINR30_31,4)
// RPINR30_31<MDCIN2R1>
extern volatile __bit                   MDCIN2R1            __at(0x71CD);	// @ (0xE39 * 8 + 5)
#define                                 MDCIN2R1_bit        _BIT_ACCESS(RPINR30_31,5)
// RPINR30_31<MDCIN2R2>
extern volatile __bit                   MDCIN2R2            __at(0x71CE);	// @ (0xE39 * 8 + 6)
#define                                 MDCIN2R2_bit        _BIT_ACCESS(RPINR30_31,6)
// RPINR30_31<MDCIN2R3>
extern volatile __bit                   MDCIN2R3            __at(0x71CF);	// @ (0xE39 * 8 + 7)
#define                                 MDCIN2R3_bit        _BIT_ACCESS(RPINR30_31,7)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCARL<MDCLODIS>
extern volatile __bit                   MDCLODIS            __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 MDCLODIS_bit        _BIT_ACCESS(MDCARL,7)
// MDCARL<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCARL,6)
// MDCARL<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCARL,5)
// MDCON<MDEN>
extern volatile __bit                   MDEN                __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON,7)
// RPINR28_29<MDMINR0>
extern volatile __bit                   MDMINR0             __at(0x71C4);	// @ (0xE38 * 8 + 4)
#define                                 MDMINR0_bit         _BIT_ACCESS(RPINR28_29,4)
// RPINR28_29<MDMINR1>
extern volatile __bit                   MDMINR1             __at(0x71C5);	// @ (0xE38 * 8 + 5)
#define                                 MDMINR1_bit         _BIT_ACCESS(RPINR28_29,5)
// RPINR28_29<MDMINR2>
extern volatile __bit                   MDMINR2             __at(0x71C6);	// @ (0xE38 * 8 + 6)
#define                                 MDMINR2_bit         _BIT_ACCESS(RPINR28_29,6)
// RPINR28_29<MDMINR3>
extern volatile __bit                   MDMINR3             __at(0x71C7);	// @ (0xE38 * 8 + 7)
#define                                 MDMINR3_bit         _BIT_ACCESS(RPINR28_29,7)
// MDCON<MDO>
extern volatile __bit                   MDO                 __at(0x777B);	// @ (0xEEF * 8 + 3)
#define                                 MDO_bit             _BIT_ACCESS(MDCON,3)
// MDCON<MDOE>
extern volatile __bit                   MDOE                __at(0x777E);	// @ (0xEEF * 8 + 6)
#define                                 MDOE_bit            _BIT_ACCESS(MDCON,6)
// MDCON<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x777C);	// @ (0xEEF * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON,4)
// MDCON<MDSLR>
extern volatile __bit                   MDSLR               __at(0x777D);	// @ (0xEEF * 8 + 5)
#define                                 MDSLR_bit           _BIT_ACCESS(MDCON,5)
// MDSRC<MDSODIS>
extern volatile __bit                   MDSODIS             __at(0x7777);	// @ (0xEEE * 8 + 7)
#define                                 MDSODIS_bit         _BIT_ACCESS(MDSRC,7)
// MDSRC<MDSRC0>
extern volatile __bit                   MDSRC0              __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 MDSRC0_bit          _BIT_ACCESS(MDSRC,0)
// MDSRC<MDSRC1>
extern volatile __bit                   MDSRC1              __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 MDSRC1_bit          _BIT_ACCESS(MDSRC,1)
// MDSRC<MDSRC2>
extern volatile __bit                   MDSRC2              __at(0x7772);	// @ (0xEEE * 8 + 2)
#define                                 MDSRC2_bit          _BIT_ACCESS(MDSRC,2)
// MDSRC<MDSRC3>
extern volatile __bit                   MDSRC3              __at(0x7773);	// @ (0xEEE * 8 + 3)
#define                                 MDSRC3_bit          _BIT_ACCESS(MDSRC,3)
// ADCON1H<MODE12>
extern volatile __bit                   MODE12              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 MODE12_bit          _BIT_ACCESS(ADCON1H,2)
// LCDREG<MODE13>
extern volatile __bit                   MODE13              __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 MODE13_bit          _BIT_ACCESS(LCDREG,2)
// PMD3<MODMD>
extern volatile __bit                   MODMD               __at(0x778F);	// @ (0xEF1 * 8 + 7)
