MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
extern volatile __bit                   S36C0               __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA12<S36C1>
extern volatile __bit                   S36C1               __at(0x74D4);	// @ (0xE9A * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA20<S36C2>
extern volatile __bit                   S36C2               __at(0x7514);	// @ (0xEA2 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA20,4)
// LCDDATA28<S36C3>
extern volatile __bit                   S36C3               __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA28,4)
// LCDDATA36<S36C4>
extern volatile __bit                   S36C4               __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 S36C4_bit           _BIT_ACCESS(LCDDATA36,4)
// LCDDATA44<S36C5>
extern volatile __bit                   S36C5               __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 S36C5_bit           _BIT_ACCESS(LCDDATA44,4)
// LCDDATA52<S36C6>
extern volatile __bit                   S36C6               __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 S36C6_bit           _BIT_ACCESS(LCDDATA52,4)
// LCDDATA60<S36C7>
extern volatile __bit                   S36C7               __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 S36C7_bit           _BIT_ACCESS(LCDDATA60,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0x7495);	// @ (0xE92 * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA12<S37C1>
extern volatile __bit                   S37C1               __at(0x74D5);	// @ (0xE9A * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA20<S37C2>
extern volatile __bit                   S37C2               __at(0x7515);	// @ (0xEA2 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA20,5)
// LCDDATA28<S37C3>
extern volatile __bit                   S37C3               __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA28,5)
// LCDDATA36<S37C4>
extern volatile __bit                   S37C4               __at(0x7595);	// @ (0xEB2 * 8 + 5)
#define                                 S37C4_bit           _BIT_ACCESS(LCDDATA36,5)
// LCDDATA44<S37C5>
extern volatile __bit                   S37C5               __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 S37C5_bit           _BIT_ACCESS(LCDDATA44,5)
// LCDDATA52<S37C6>
extern volatile __bit                   S37C6               __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 S37C6_bit           _BIT_ACCESS(LCDDATA52,5)
// LCDDATA60<S37C7>
extern volatile __bit                   S37C7               __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 S37C7_bit           _BIT_ACCESS(LCDDATA60,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0x7496);	// @ (0xE92 * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA12<S38C1>
extern volatile __bit                   S38C1               __at(0x74D6);	// @ (0xE9A * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA20<S38C2>
extern volatile __bit                   S38C2               __at(0x7516);	// @ (0xEA2 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA20,6)
// LCDDATA28<S38C3>
extern volatile __bit                   S38C3               __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA28,6)
// LCDDATA36<S38C4>
extern volatile __bit                   S38C4               __at(0x7596);	// @ (0xEB2 * 8 + 6)
#define                                 S38C4_bit           _BIT_ACCESS(LCDDATA36,6)
// LCDDATA44<S38C5>
extern volatile __bit                   S38C5               __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 S38C5_bit           _BIT_ACCESS(LCDDATA44,6)
// LCDDATA52<S38C6>
extern volatile __bit                   S38C6               __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 S38C6_bit           _BIT_ACCESS(LCDDATA52,6)
// LCDDATA60<S38C7>
extern volatile __bit                   S38C7               __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 S38C7_bit           _BIT_ACCESS(LCDDATA60,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0x7497);	// @ (0xE92 * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA12<S39C1>
extern volatile __bit                   S39C1               __at(0x74D7);	// @ (0xE9A * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA20<S39C2>
extern volatile __bit                   S39C2               __at(0x7517);	// @ (0xEA2 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA20,7)
// LCDDATA28<S39C3>
extern volatile __bit                   S39C3               __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA28,7)
// LCDDATA36<S39C4>
extern volatile __bit                   S39C4               __at(0x7597);	// @ (0xEB2 * 8 + 7)
#define                                 S39C4_bit           _BIT_ACCESS(LCDDATA36,7)
// LCDDATA44<S39C5>
extern volatile __bit                   S39C5               __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 S39C5_bit           _BIT_ACCESS(LCDDATA44,7)
// LCDDATA52<S39C6>
extern volatile __bit                   S39C6               __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 S39C6_bit           _BIT_ACCESS(LCDDATA52,7)
// LCDDATA60<S39C7>
extern volatile __bit                   S39C7               __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 S39C7_bit           _BIT_ACCESS(LCDDATA60,7)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA13<S40C1>
extern volatile __bit                   S40C1               __at(0x74D8);	// @ (0xE9B * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA5<S40C15>
extern volatile __bit                   S40C15              __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 S40C15_bit          _BIT_ACCESS(LCDDATA5,0)
// LCDDATA21<S40C2>
extern volatile __bit                   S40C2               __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA29<S40C3>
extern volatile __bit                   S40C3               __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA29,0)
// LCDDATA37<S40C4>
extern volatile __bit                   S40C4               __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 S40C4_bit           _BIT_ACCESS(LCDDATA37,0)
// LCDDATA45<S40C5>
extern volatile __bit                   S40C5               __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 S40C5_bit           _BIT_ACCESS(LCDDATA45,0)
// LCDDATA53<S40C6>
extern volatile __bit                   S40C6               __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 S40C6_bit           _BIT_ACCESS(LCDDATA53,0)
// LCDDATA61<S40C7>
extern volatile __bit                   S40C7               __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 S40C7_bit           _BIT_ACCESS(LCDDATA61,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0x7499);	// @ (0xE93 * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA13<S41C1>
extern volatile __bit                   S41C1               __at(0x74D9);	// @ (0xE9B * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA21<S41C2>
extern volatile __bit                   S41C2               __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA29<S41C3>
extern volatile __bit                   S41C3               __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA29,1)
// LCDDATA37<S41C4>
extern volatile __bit                   S41C4               __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 S41C4_bit           _BIT_ACCESS(LCDDATA37,1)
// LCDDATA45<S41C5>
extern volatile __bit                   S41C5               __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 S41C5_bit           _BIT_ACCESS(LCDDATA45,1)
// LCDDATA53<S41C6>
extern volatile __bit                   S41C6               __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 S41C6_bit           _BIT_ACCESS(LCDDATA53,1)
// LCDDATA61<S41C7>
extern volatile __bit                   S41C7               __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 S41C7_bit           _BIT_ACCESS(LCDDATA61,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0x749A);	// @ (0xE93 * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA13<S42C1>
extern volatile __bit                   S42C1               __at(0x74DA);	// @ (0xE9B * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA21<S42C2>
extern volatile __bit                   S42C2               __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA29<S42C3>
extern volatile __bit                   S42C3               __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA29,2)
// LCDDATA37<S42C4>
extern volatile __bit                   S42C4               __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 S42C4_bit           _BIT_ACCESS(LCDDATA37,2)
// LCDDATA45<S42C5>
extern volatile __bit                   S42C5               __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 S42C5_bit           _BIT_ACCESS(LCDDATA45,2)
// LCDDATA53<S42C6>
extern volatile __bit                   S42C6               __at(0x761A);	// @ (0xEC3 * 8 + 2)
#define                                 S42C6_bit           _BIT_ACCESS(LCDDATA53,2)
// LCDDATA61<S42C7>
extern volatile __bit                   S42C7               __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 S42C7_bit           _BIT_ACCESS(LCDDATA61,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0x749B);	// @ (0xE93 * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA13<S43C1>
extern volatile __bit                   S43C1               __at(0x74DB);	// @ (0xE9B * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA21<S43C2>
extern volatile __bit                   S43C2               __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA29<S43C3>
extern volatile __bit                   S43C3               __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA29,3)
// LCDDATA37<S43C4>
extern volatile __bit                   S43C4               __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 S43C4_bit           _BIT_ACCESS(LCDDATA37,3)
// LCDDATA45<S43C5>
extern volatile __bit                   S43C5               __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 S43C5_bit           _BIT_ACCESS(LCDDATA45,3)
// LCDDATA53<S43C6>
extern volatile __bit                   S43C6               __at(0x761B);	// @ (0xEC3 * 8 + 3)
#define                                 S43C6_bit           _BIT_ACCESS(LCDDATA53,3)
// LCDDATA61<S43C7>
extern volatile __bit                   S43C7               __at(0x765B);	// @ (0xECB * 8 + 3)
#define                                 S43C7_bit           _BIT_ACCESS(LCDDATA61,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x749C);	// @ (0xE93 * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA13<S44C1>
extern volatile __bit                   S44C1               __at(0x74DC);	// @ (0xE9B * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA13,4)
// LCDDATA21<S44C2>
extern volatile __bit                   S44C2               __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA29<S44C3>
extern volatile __bit                   S44C3               __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA29,4)
// LCDDATA37<S44C4>
extern volatile __bit                   S44C4               __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 S44C4_bit           _BIT_ACCESS(LCDDATA37,4)
// LCDDATA45<S44C5>
extern volatile __bit                   S44C5               __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 S44C5_bit           _BIT_ACCESS(LCDDATA45,4)
// LCDDATA53<S44C6>
extern volatile __bit                   S44C6               __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 S44C6_bit           _BIT_ACCESS(LCDDATA53,4)
// LCDDATA61<S44C7>
extern volatile __bit                   S44C7               __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 S44C7_bit           _BIT_ACCESS(LCDDATA61,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x749D);	// @ (0xE93 * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA13<S45C1>
extern volatile __bit                   S45C1               __at(0x74DD);	// @ (0xE9B * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA21<S45C2>
extern volatile __bit                   S45C2               __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA29<S45C3>
extern volatile __bit                   S45C3               __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA29,5)
// LCDDATA37<S45C4>
extern volatile __bit                   S45C4               __at(0x759D);	// @ (0xEB3 * 8 + 5)
#define                                 S45C4_bit           _BIT_ACCESS(LCDDATA37,5)
// LCDDATA45<S45C5>
extern volatile __bit                   S45C5               __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 S45C5_bit           _BIT_ACCESS(LCDDATA45,5)
// LCDDATA53<S45C6>
extern volatile __bit                   S45C6               __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 S45C6_bit           _BIT_ACCESS(LCDDATA53,5)
// LCDDATA61<S45C7>
extern volatile __bit                   S45C7               __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 S45C7_bit           _BIT_ACCESS(LCDDATA61,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x749E);	// @ (0xE93 * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA13<S46C1>
extern volatile __bit                   S46C1               __at(0x74DE);	// @ (0xE9B * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA21<S46C2>
extern volatile __bit                   S46C2               __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA29<S46C3>
extern volatile __bit                   S46C3               __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA29,6)
// LCDDATA37<S46C4>
extern volatile __bit                   S46C4               __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 S46C4_bit           _BIT_ACCESS(LCDDATA37,6)
// LCDDATA45<S46C5>
extern volatile __bit                   S46C5               __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 S46C5_bit           _BIT_ACCESS(LCDDATA45,6)
// LCDDATA53<S46C6>
extern volatile __bit                   S46C6               __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 S46C6_bit           _BIT_ACCESS(LCDDATA53,6)
// LCDDATA61<S46C7>
extern volatile __bit                   S46C7               __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 S46C7_bit           _BIT_ACCESS(LCDDATA61,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0x749F);	// @ (0xE93 * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA13<S47C1>
extern volatile __bit                   S47C1               __at(0x74DF);	// @ (0xE9B * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA13,7)
// LCDDATA21<S47C2>
extern volatile __bit                   S47C2               __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA29<S47C3>
extern volatile __bit                   S47C3               __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA29,7)
// LCDDATA37<S47C4>
extern volatile __bit                   S47C4               __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 S47C4_bit           _BIT_ACCESS(LCDDATA37,7)
// LCDDATA45<S47C5>
extern volatile __bit                   S47C5               __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 S47C5_bit           _BIT_ACCESS(LCDDATA45,7)
// LCDDATA53<S47C6>
extern volatile __bit                   S47C6               __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 S47C6_bit           _BIT_ACCESS(LCDDATA53,7)
// LCDDATA61<S47C7>
extern volatile __bit                   S47C7               __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 S47C7_bit           _BIT_ACCESS(LCDDATA61,7)
// LCDDATA6<S48C0>
extern volatile __bit                   S48C0               __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 S48C0_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA14<S48C1>
extern volatile __bit                   S48C1               __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 S48C1_bit           _BIT_ACCESS(LCDDATA14,0)
// LCDDATA22<S48C2>
extern volatile __bit                   S48C2               __at(0x7520);	// @ (0xEA4 * 8 + 0)
#define                                 S48C2_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA30<S48C3>
extern volatile __bit                   S48C3               __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 S48C3_bit           _BIT_ACCESS(LCDDATA30,0)
// LCDDATA38<S48C4>
extern volatile __bit                   S48C4               __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 S48C4_bit           _BIT_ACCESS(LCDDATA38,0)
// LCDDATA46<S48C5>
extern volatile __bit                   S48C5               __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 S48C5_bit           _BIT_ACCESS(LCDDATA46,0)
// LCDDATA54<S48C6>
extern volatile __bit                   S48C6               __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 S48C6_bit           _BIT_ACCESS(LCDDATA54,0)
// LCDDATA62<S48C7>
extern volatile __bit                   S48C7               __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 S48C7_bit           _BIT_ACCESS(LCDDATA62,0)
// LCDDATA6<S49C0>
extern volatile __bit                   S49C0               __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 S49C0_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA14<S49C1>
extern volatile __bit                   S49C1               __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 S49C1_bit           _BIT_ACCESS(LCDDATA14,1)
// LCDDATA22<S49C2>
extern volatile __bit                   S49C2               __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 S49C2_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA30<S49C3>
extern volatile __bit                   S49C3               __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 S49C3_bit           _BIT_ACCESS(LCDDATA30,1)
// LCDDATA38<S49C4>
extern volatile __bit                   S49C4               __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 S49C4_bit           _BIT_ACCESS(LCDDATA38,1)
// LCDDATA46<S49C5>
extern volatile __bit                   S49C5               __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 S49C5_bit           _BIT_ACCESS(LCDDATA46,1)
// LCDDATA54<S49C6>
extern volatile __bit                   S49C6               __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 S49C6_bit           _BIT_ACCESS(LCDDATA54,1)
// LCDDATA62<S49C7>
extern volatile __bit                   S49C7               __at(0x7661);	// @ (0xECC * 8 + 1)
#define                                 S49C7_bit           _BIT_ACCESS(LCDDATA62,1)
// LCDDATA6<S50C0>
extern volatile __bit                   S50C0               __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 S50C0_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA14<S50C1>
extern volatile __bit                   S50C1               __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 S50C1_bit           _BIT_ACCESS(LCDDATA14,2)
// LCDDATA22<S50C2>
extern volatile __bit                   S50C2               __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 S50C2_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA30<S50C3>
extern volatile __bit                   S50C3               __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 S50C3_bit           _BIT_ACCESS(LCDDATA30,2)
// LCDDATA38<S50C4>
extern volatile __bit                   S50C4               __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 S50C4_bit           _BIT_ACCESS(LCDDATA38,2)
// LCDDATA46<S50C5>
extern volatile __bit                   S50C5               __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 S50C5_bit           _BIT_ACCESS(LCDDATA46,2)
// LCDDATA54<S50C6>
extern volatile __bit                   S50C6               __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 S50C6_bit           _BIT_ACCESS(LCDDATA54,2)
// LCDDATA62<S50C7>
