MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J94/mcu.h
extern volatile __bit                   SCKP1               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// BAUDCON3<SCKP3>
extern volatile __bit                   SCKP3               __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 SCKP3_bit           _BIT_ACCESS(BAUDCON3,4)
// BAUDCON4<SCKP4>
extern volatile __bit                   SCKP4               __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 SCKP4_bit           _BIT_ACCESS(BAUDCON4,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// RPINR8_9<SDI1R0>
extern volatile __bit                   SDI1R0              __at(0x7174);	// @ (0xE2E * 8 + 4)
#define                                 SDI1R0_bit          _BIT_ACCESS(RPINR8_9,4)
// RPINR8_9<SDI1R1>
extern volatile __bit                   SDI1R1              __at(0x7175);	// @ (0xE2E * 8 + 5)
#define                                 SDI1R1_bit          _BIT_ACCESS(RPINR8_9,5)
// RPINR8_9<SDI1R2>
extern volatile __bit                   SDI1R2              __at(0x7176);	// @ (0xE2E * 8 + 6)
#define                                 SDI1R2_bit          _BIT_ACCESS(RPINR8_9,6)
// RPINR8_9<SDI1R3>
extern volatile __bit                   SDI1R3              __at(0x7177);	// @ (0xE2E * 8 + 7)
#define                                 SDI1R3_bit          _BIT_ACCESS(RPINR8_9,7)
// RPINR12_13<SDI2R0>
extern volatile __bit                   SDI2R0              __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 SDI2R0_bit          _BIT_ACCESS(RPINR12_13,0)
// RPINR12_13<SDI2R1>
extern volatile __bit                   SDI2R1              __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 SDI2R1_bit          _BIT_ACCESS(RPINR12_13,1)
// RPINR12_13<SDI2R2>
extern volatile __bit                   SDI2R2              __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 SDI2R2_bit          _BIT_ACCESS(RPINR12_13,2)
// RPINR12_13<SDI2R3>
extern volatile __bit                   SDI2R3              __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 SDI2R3_bit          _BIT_ACCESS(RPINR12_13,3)
// UCON<SE0>
extern volatile __bit                   SE0                 __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SE0_bit             _BIT_ACCESS(UCON,5)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0x7671);	// @ (0xECE * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0x7672);	// @ (0xECE * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0x7673);	// @ (0xECE * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0x7674);	// @ (0xECE * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0x7675);	// @ (0xECE * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0x7676);	// @ (0xECE * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0x7677);	// @ (0xECE * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0x7678);	// @ (0xECF * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
extern volatile __bit                   SE09                __at(0x7679);	// @ (0xECF * 8 + 1)
#define                                 SE09_bit            _BIT_ACCESS(LCDSE1,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x767A);	// @ (0xECF * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x767B);	// @ (0xECF * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x767C);	// @ (0xECF * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x767D);	// @ (0xECF * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x767E);	// @ (0xECF * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x767F);	// @ (0xECF * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x7680);	// @ (0xED0 * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x7681);	// @ (0xED0 * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x7682);	// @ (0xED0 * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x7683);	// @ (0xED0 * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x7685);	// @ (0xED0 * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x7686);	// @ (0xED0 * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x7687);	// @ (0xED0 * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0x768B);	// @ (0xED1 * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0x768C);	// @ (0xED1 * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0x768E);	// @ (0xED1 * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0x7694);	// @ (0xED2 * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SE42>
extern volatile __bit                   SE42                __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 SE42_bit            _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SE43>
extern volatile __bit                   SE43                __at(0x769B);	// @ (0xED3 * 8 + 3)
#define                                 SE43_bit            _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SE44>
extern volatile __bit                   SE44                __at(0x769C);	// @ (0xED3 * 8 + 4)
#define                                 SE44_bit            _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SE45>
extern volatile __bit                   SE45                __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 SE45_bit            _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SE46>
extern volatile __bit                   SE46                __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 SE46_bit            _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SE47>
extern volatile __bit                   SE47                __at(0x769F);	// @ (0xED3 * 8 + 7)
#define                                 SE47_bit            _BIT_ACCESS(LCDSE5,7)
// LCDSE6<SE48>
extern volatile __bit                   SE48                __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 SE48_bit            _BIT_ACCESS(LCDSE6,0)
// LCDSE6<SE49>
extern volatile __bit                   SE49                __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 SE49_bit            _BIT_ACCESS(LCDSE6,1)
// LCDSE6<SE50>
extern volatile __bit                   SE50                __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 SE50_bit            _BIT_ACCESS(LCDSE6,2)
// LCDSE6<SE51>
extern volatile __bit                   SE51                __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 SE51_bit            _BIT_ACCESS(LCDSE6,3)
// LCDSE6<SE52>
extern volatile __bit                   SE52                __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 SE52_bit            _BIT_ACCESS(LCDSE6,4)
// LCDSE6<SE53>
extern volatile __bit                   SE53                __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 SE53_bit            _BIT_ACCESS(LCDSE6,5)
// LCDSE6<SE54>
extern volatile __bit                   SE54                __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 SE54_bit            _BIT_ACCESS(LCDSE6,6)
// LCDSE6<SE55>
extern volatile __bit                   SE55                __at(0x76A7);	// @ (0xED4 * 8 + 7)
#define                                 SE55_bit            _BIT_ACCESS(LCDSE6,7)
// LCDSE7<SE56>
extern volatile __bit                   SE56                __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 SE56_bit            _BIT_ACCESS(LCDSE7,0)
// LCDSE7<SE57>
extern volatile __bit                   SE57                __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 SE57_bit            _BIT_ACCESS(LCDSE7,1)
// LCDSE7<SE58>
extern volatile __bit                   SE58                __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 SE58_bit            _BIT_ACCESS(LCDSE7,2)
// LCDSE7<SE59>
extern volatile __bit                   SE59                __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 SE59_bit            _BIT_ACCESS(LCDSE7,3)
// LCDSE7<SE60>
extern volatile __bit                   SE60                __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 SE60_bit            _BIT_ACCESS(LCDSE7,4)
// LCDSE7<SE61>
extern volatile __bit                   SE61                __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 SE61_bit            _BIT_ACCESS(LCDSE7,5)
// LCDSE7<SE62>
extern volatile __bit                   SE62                __at(0x76AE);	// @ (0xED5 * 8 + 6)
#define                                 SE62_bit            _BIT_ACCESS(LCDSE7,6)
// LCDSE7<SE63>
extern volatile __bit                   SE63                __at(0x76AF);	// @ (0xED5 * 8 + 7)
#define                                 SE63_bit            _BIT_ACCESS(LCDSE7,7)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x76CE);	// @ (0xED9 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// ADCON2L<SMPI0>
extern volatile __bit                   SMPI0               __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 SMPI0_bit           _BIT_ACCESS(ADCON2L,2)
// ADCON2L<SMPI1>
extern volatile __bit                   SMPI1               __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 SMPI1_bit           _BIT_ACCESS(ADCON2L,3)
// ADCON2L<SMPI2>
extern volatile __bit                   SMPI2               __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 SMPI2_bit           _BIT_ACCESS(ADCON2L,4)
// ADCON2L<SMPI3>
extern volatile __bit                   SMPI3               __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 SMPI3_bit           _BIT_ACCESS(ADCON2L,5)
// ADCON2L<SMPI4>
extern volatile __bit                   SMPI4               __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 SMPI4_bit           _BIT_ACCESS(ADCON2L,6)
// UIE<SOFIE>
extern volatile __bit                   SOFIE               __at(0x7086);	// @ (0xE10 * 8 + 6)
#define                                 SOFIE_bit           _BIT_ACCESS(UIE,6)
// UIR<SOFIF>
extern volatile __bit                   SOFIF               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 SOFIF_bit           _BIT_ACCESS(UIR,6)
// T1CON<SOSCEN1>
extern volatile __bit                   SOSCEN1             __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 SOSCEN1_bit         _BIT_ACCESS(T1CON,3)
// T3CON<SOSCEN3>
extern volatile __bit                   SOSCEN3             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 SOSCEN3_bit         _BIT_ACCESS(T3CON,3)
// T5CON<SOSCEN5>
extern volatile __bit                   SOSCEN5             __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 SOSCEN5_bit         _BIT_ACCESS(T5CON,3)
// OSCCON2<SOSCGO>
extern volatile __bit                   SOSCGO              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 SOSCGO_bit          _BIT_ACCESS(OSCCON2,1)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// PMD0<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x77A1);	// @ (0xEF4 * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD0,1)
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x77A2);	// @ (0xEF4 * 8 + 2)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD0,2)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// RCON4<SRETEN>
extern volatile __bit                   SRETEN              __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 SRETEN_bit          _BIT_ACCESS(RCON4,4)
// RPINR10_11<SS1R0>
extern volatile __bit                   SS1R0               __at(0x7178);	// @ (0xE2F * 8 + 0)
#define                                 SS1R0_bit           _BIT_ACCESS(RPINR10_11,0)
// RPINR10_11<SS1R1>
extern volatile __bit                   SS1R1               __at(0x7179);	// @ (0xE2F * 8 + 1)
#define                                 SS1R1_bit           _BIT_ACCESS(RPINR10_11,1)
// RPINR10_11<SS1R2>
extern volatile __bit                   SS1R2               __at(0x717A);	// @ (0xE2F * 8 + 2)
#define                                 SS1R2_bit           _BIT_ACCESS(RPINR10_11,2)
// RPINR10_11<SS1R3>
extern volatile __bit                   SS1R3               __at(0x717B);	// @ (0xE2F * 8 + 3)
#define                                 SS1R3_bit           _BIT_ACCESS(RPINR10_11,3)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// RPINR12_13<SS2R0>
extern volatile __bit                   SS2R0               __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 SS2R0_bit           _BIT_ACCESS(RPINR12_13,4)
// RPINR12_13<SS2R1>
extern volatile __bit                   SS2R1               __at(0x7185);	// @ (0xE30 * 8 + 5)
#define                                 SS2R1_bit           _BIT_ACCESS(RPINR12_13,5)
// RPINR12_13<SS2R2>
extern volatile __bit                   SS2R2               __at(0x7186);	// @ (0xE30 * 8 + 6)
#define                                 SS2R2_bit           _BIT_ACCESS(RPINR12_13,6)
// RPINR12_13<SS2R3>
extern volatile __bit                   SS2R3               __at(0x7187);	// @ (0xE30 * 8 + 7)
#define                                 SS2R3_bit           _BIT_ACCESS(RPINR12_13,7)
// DMACON1<SSCON0>
extern volatile __bit                   SSCON0              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 SSCON0_bit          _BIT_ACCESS(DMACON1,6)
// DMACON1<SSCON1>
extern volatile __bit                   SSCON1              __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 SSCON1_bit          _BIT_ACCESS(DMACON1,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// IPR1<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR1,3)
// PMD1<SSP1MD>
extern volatile __bit                   SSP1MD              __at(0x7798);	// @ (0xEF3 * 8 + 0)
#define                                 SSP1MD_bit          _BIT_ACCESS(PMD1,0)
// ODCON1<SSP1OD>
extern volatile __bit                   SSP1OD              __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 SSP1OD_bit          _BIT_ACCESS(ODCON1,0)
// PIE2<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR2,6)
// IPR2<SSP2IP>
extern volatile __bit                   SSP2IP              __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 SSP2IP_bit          _BIT_ACCESS(IPR2,6)
// PMD1<SSP2MD>
extern volatile __bit                   SSP2MD              __at(0x7799);	// @ (0xEF3 * 8 + 1)
